<?php
$data = array(
    'main' => array(
        'el' => array(
            'localeDisplayNames' => array(
                'localeDisplayPattern' => array(
                    'localePattern' => '{0} ({1})',
                    'localeSeparator' => ',',
                    'localeKeyTypePattern' => '{0}: {1}'
                ),
                'keys' => array(
                    'calendar' => 'Ημερολόγιο',
                    'colAlternate' => 'Ταξινόμηση με αγνόηση συμβόλων',
                    'colBackwards' => 'Ταξινόμηση με αντεστραμμένο τονισμό',
                    'colCaseFirst' => 'Ταξινόμηση με κεφαλαίους/πεζούς χαρακτήρες',
                    'colCaseLevel' => 'Ταξινόμηση με διάκριση χαρακτήρων',
                    'colHiraganaQuaternary' => 'Ταξινόμηση Κάνα',
                    'collation' => 'Σειρά ταξινόμησης',
                    'colNormalization' => 'Κανονικοποιημένη ταξινόμηση',
                    'colNumeric' => 'Αριθμητική ταξινόμηση',
                    'colStrength' => 'Ισχύς ταξινόμησης',
                    'currency' => 'Νόμισμα',
                    'numbers' => 'Αριθμοί',
                    'timezone' => 'Ζώνη ώρας',
                    'va' => 'Παραλλαγή τοπικών ρυθμίσεων',
                    'variableTop' => 'Ταξινόμηση ως σύμβολα',
                    'x' => 'Προσωπική χρήση'
                ),
                'types' => array(
                    'calendar' => array(
                        'buddhist' => 'Βουδιστικό ημερολόγιο',
                        'chinese' => 'Κινεζικό ημερολόγιο',
                        'coptic' => 'Κοπτικό ημερολόγιο',
                        'dangi' => 'dangi',
                        'ethiopic' => 'Αιθιοπικό ημερολόγιο',
                        'ethiopic-amete-alem' => 'Αιθιοπικό ημερολόγιο Άμετ Άλεμ',
                        'gregorian' => 'Γρηγοριανό ημερολόγιο',
                        'hebrew' => 'Εβραϊκό ημερολόγιο',
                        'indian' => 'Ινδικό εθνικό ημερολόγιο',
                        'islamic' => 'Ισλαμικό ημερολόγιο',
                        'islamic-civil' => 'Ισλαμικό αστικό ημερολόγιο',
                        'iso8601' => 'iso8601',
                        'japanese' => 'Ιαπωνικό ημερολόγιο',
                        'persian' => 'Περσικό ημερολόγιο',
                        'roc' => 'Ημερολόγιο της Δημοκρατίας της Κίνας'
                    ),
                    'collation' => array(
                        'standard' => 'standard',
                        'traditional' => 'Παραδοσιακή σειρά ταξινόμησης',
                        'big5han' => 'Σειρά ταξινόμησης Παραδοσιακών Κινεζικών - Big5',
                        'dictionary' => 'Σειρά ταξινόμησης ημερολογίου',
                        'ducet' => 'Προεπιλεγμένη σειρά ταξινόμησης Unicode',
                        'gb2312han' => 'Σειρά ταξινόμησης Απλουστευμένων Κινεζικών - GB2312',
                        'phonebook' => 'Σειρά ταξινόμησης τηλεφωνικού καταλόγου',
                        'phonetic' => 'Φωνητική σειρά ταξινόμησης',
                        'pinyin' => 'Σειρά ταξινόμησης Πινγίν',
                        'reformed' => 'Ανασχηματισμένη σειρά ταξινόμησης',
                        'search' => 'Αναζήτηση γενικού τύπου',
                        'searchjl' => 'Αναζήτηση κατά αρχικό σύμφωνο Χανγκούλ',
                        'stroke' => 'Σειρά ταξινόμησης κινήσεων',
                        'unihan' => 'Σειρά ταξινόμησης ριζικής αρίθμησης',
                        'zhuyin' => 'zhuyin'
                    ),
                    'numbers' => array(
                        'native' => 'Εγγενή ψηφία',
                        'traditional' => 'Παραδοσιακά αριθμητικά',
                        'finance' => 'Οικονομικά αριθμητικά',
                        'arab' => 'Αραβικό-Ινδικά ψηφία',
                        'arabext' => 'Εκτεταμένα Αραβικό-Ινδικά ψηφία',
                        'armn' => 'Αρμενικά αριθμητικά',
                        'armnlow' => 'Πεζά αρμενικά αριθμητικά',
                        'bali' => 'bali',
                        'beng' => 'Βεγγαλικά ψηφία',
                        'brah' => 'brah',
                        'cakm' => 'cakm',
                        'cham' => 'cham',
                        'deva' => 'Ψηφία Ντεβαναγκάρι',
                        'ethi' => 'Αιθιοπικά αριθμητικά',
                        'fullwide' => 'Ψηφία πλήρους πλάτους',
                        'geor' => 'Γεωργιανά αριθμητικά',
                        'grek' => 'Ελληνικοί αριθμοί',
                        'greklow' => 'Ελληνικοί αριθμοί με πεζά γράμματα',
                        'gujr' => 'Γκουτζαρατικά ψηφία',
                        'guru' => 'Ψηφία Γκουρμούκι',
                        'hanidec' => 'Κινεζικοί δεκαδικοί αριθμοί',
                        'hans' => 'Απλοποιημένα Κινεζικά αριθμητικά',
                        'hansfin' => 'Απλοποιημένα Κινεζικά οικονομικά αριθμητικά',
                        'hant' => 'Παραδοσιακά Κινεζικά αριθμητικά',
                        'hantfin' => 'Παραδοσιακά Κινεζικά οικονομικά αριθμητικά',
                        'hebr' => 'Εβραϊκά αριθμητικά',
                        'java' => 'java',
                        'jpan' => 'Ιαπωνικά αριθμητικά',
                        'jpanfin' => 'Ιαπωνικά οικονομικά αριθμητικά',
                        'kali' => 'kali',
                        'khmr' => 'Ψηφία Χμερ',
                        'knda' => 'Ψηφία Κανάντα',
                        'lana' => 'lana',
                        'lanatham' => 'lanatham',
                        'laoo' => 'Λαοϊκά ψηφία',
                        'latn' => 'Ψηφία της Δύσης',
                        'lepc' => 'lepc',
                        'limb' => 'limb',
                        'mlym' => 'Μαλαγιαλαμικά ψηφία',
                        'mong' => 'Μογγολικά ψηφία',
                        'mtei' => 'mtei',
                        'mymr' => 'Ψηφία Μιανμάρ',
                        'mymrshan' => 'mymrshan',
                        'nkoo' => 'nkoo',
                        'olck' => 'olck',
                        'orya' => 'Οριγικά ψηφία',
                        'osma' => 'osma',
                        'roman' => 'Λατινικοί αριθμοί',
                        'romanlow' => 'Πεζοί λατινικοί αριθμοί',
                        'saur' => 'saur',
                        'shrd' => 'shrd',
                        'sora' => 'sora',
                        'sund' => 'sund',
                        'takr' => 'takr',
                        'talu' => 'talu',
                        'taml' => 'Ταμιλικά αριθμητικά',
                        'tamldec' => 'Ταμιλικά ψηφία',
                        'telu' => 'Τελουγκουϊκά Ψηφία',
                        'thai' => 'Ταϊλανδικά ψηφία',
                        'tibt' => 'Θιβετανικά ψηφία',
                        'vaii' => 'Ψηφία Βάι'
                    ),
                    'colAlternate' => array(
                        'non-ignorable' => 'Ταξινόμηση συμβόλων',
                        'shifted' => 'Ταξινόμηση με αγνόηση συμβόλων'
                    ),
                    'colBackwards' => array(
                        'no' => 'Κανονικά ταξινόμηση τόνων',
                        'yes' => 'Αντίστροφη ταξινόμηση τόνων'
                    ),
                    'colCaseFirst' => array(
                        'lower' => 'Ταξινόμηση πεζών χαρακτήρων πρώτα',
                        'no' => 'Κανονική ταξινόμηση χαρακτήρων',
                        'upper' => 'Ταξινόμηση κεφαλαίων χαρακτήρων πρώτα'
                    ),
                    'colCaseLevel' => array(
                        'no' => 'Ταξινόμηση με διάκριση χαρακτήρων',
                        'yes' => 'Ταξινόμηση χαρακτήρων διάκρισης'
                    ),
                    'colHiraganaQuaternary' => array(
                        'no' => 'Ξεχωριστή ταξινόμηση χαρακτήρων Κάνα',
                        'yes' => 'Διαφορετική ταξινόμηση Κάνα'
                    ),
                    'colNormalization' => array(
                        'no' => 'Ταξινόμηση χωρίς κανονικοποίηση',
                        'yes' => 'Κανονικοποιημένη ταξινόμηση Unicode'
                    ),
                    'colNumeric' => array(
                        'no' => 'Μεμονωμένη ταξινόμηση ψηφίων',
                        'yes' => 'Αριθμητική ταξινόμηση ψηφίων'
                    ),
                    'colStrength' => array(
                        'identical' => 'Ταξινόμηση όλων',
                        'primary' => 'Ταξινόμηση μόνο βασικών χαρακτήρων',
                        'quaternary' => 'Ταξινόμηση τόνων/χαρακτήρων διάκρισης/χαρακτήρων μεγάλου μεγέθους/χαρακτήρων Κάνα',
                        'secondary' => 'Ταξινόμηση τόνων',
                        'tertiary' => 'Ταξινόμηση τόνων/χαρακτήρων διάκρισης/χαρακτήρων μεγάλου μεγέθους'
                    )
                ),
                'codePatterns' => array(
                    'language' => 'Γλώσσα: {0}',
                    'script' => 'Σύστημα γραφής: {0}',
                    'territory' => 'Περιοχή: {0}'
                )
            )
        )
    )
);

return $data;
