<?php
$data = array(
    'main' => array(
        'ko' => array(
            'dates' => array(
                'calendars' => array(
                    'dangi' => array(
                        'months' => array(
                            'format' => array(
                                'abbreviated' => array(
                                    1 => 'Month1',
                                    2 => 'Month2',
                                    3 => 'Month3',
                                    4 => 'Month4',
                                    5 => 'Month5',
                                    6 => 'Month6',
                                    7 => 'Month7',
                                    8 => 'Month8',
                                    9 => 'Month9',
                                    10 => 'Month10',
                                    11 => 'Month11',
                                    12 => 'Month12'
                                ),
                                'narrow' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                                    6 => '6',
                                    7 => '7',
                                    8 => '8',
                                    9 => '9',
                                    10 => '10',
                                    11 => '11',
                                    12 => '12'
                                ),
                                'wide' => array(
                                    1 => 'Month1',
                                    2 => 'Month2',
                                    3 => 'Month3',
                                    4 => 'Month4',
                                    5 => 'Month5',
                                    6 => 'Month6',
                                    7 => 'Month7',
                                    8 => 'Month8',
                                    9 => 'Month9',
                                    10 => 'Month10',
                                    11 => 'Month11',
                                    12 => 'Month12'
                                )
                            ),
                            'stand-alone' => array(
                                'abbreviated' => array(
                                    1 => 'Month1',
                                    2 => 'Month2',
                                    3 => 'Month3',
                                    4 => 'Month4',
                                    5 => 'Month5',
                                    6 => 'Month6',
                                    7 => 'Month7',
                                    8 => 'Month8',
                                    9 => 'Month9',
                                    10 => 'Month10',
                                    11 => 'Month11',
                                    12 => 'Month12'
                                ),
                                'narrow' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                                    6 => '6',
                                    7 => '7',
                                    8 => '8',
                                    9 => '9',
                                    10 => '10',
                                    11 => '11',
                                    12 => '12'
                                ),
                                'wide' => array(
                                    1 => 'Month1',
                                    2 => 'Month2',
                                    3 => 'Month3',
                                    4 => 'Month4',
                                    5 => 'Month5',
                                    6 => 'Month6',
                                    7 => 'Month7',
                                    8 => 'Month8',
                                    9 => 'Month9',
                                    10 => 'Month10',
                                    11 => 'Month11',
                                    12 => 'Month12'
                                )
                            )
                        ),
                        'monthPatterns' => array(
                            'format' => array(
                                'abbreviated' => array(
                                    'leap' => '{0}bis'
                                ),
                                'narrow' => array(
                                    'leap' => '{0}b'
                                ),
                                'wide' => array(
                                    'leap' => '{0}bis'
                                )
                            ),
                            'numeric' => array(
                                'all' => array(
                                    'leap' => '{0}bis'
                                )
                            ),
                            'stand-alone' => array(
                                'abbreviated' => array(
                                    'leap' => '{0}bis'
                                ),
                                'narrow' => array(
                                    'leap' => '{0}b'
                                ),
                                'wide' => array(
                                    'leap' => '{0}bis'
                                )
                            )
                        ),
                        'days' => array(
                            'format' => array(
                                'abbreviated' => array(
                                    'sun' => '일',
                                    'mon' => '월',
                                    'tue' => '화',
                                    'wed' => '수',
                                    'thu' => '목',
                                    'fri' => '금',
                                    'sat' => '토'
                                ),
                                'narrow' => array(
                                    'sun' => '일',
                                    'mon' => '월',
                                    'tue' => '화',
                                    'wed' => '수',
                                    'thu' => '목',
                                    'fri' => '금',
                                    'sat' => '토'
                                ),
                                'short' => array(
                                    'sun' => '일',
                                    'mon' => '월',
                                    'tue' => '화',
                                    'wed' => '수',
                                    'thu' => '목',
                                    'fri' => '금',
                                    'sat' => '토'
                                ),
                                'wide' => array(
                                    'sun' => '일요일',
                                    'mon' => '월요일',
                                    'tue' => '화요일',
                                    'wed' => '수요일',
                                    'thu' => '목요일',
                                    'fri' => '금요일',
                                    'sat' => '토요일'
                                )
                            ),
                            'stand-alone' => array(
                                'abbreviated' => array(
                                    'sun' => '일',
                                    'mon' => '월',
                                    'tue' => '화',
                                    'wed' => '수',
                                    'thu' => '목',
                                    'fri' => '금',
                                    'sat' => '토'
                                ),
                                'narrow' => array(
                                    'sun' => '일',
                                    'mon' => '월',
                                    'tue' => '화',
                                    'wed' => '수',
                                    'thu' => '목',
                                    'fri' => '금',
                                    'sat' => '토'
                                ),
                                'short' => array(
                                    'sun' => '일',
                                    'mon' => '월',
                                    'tue' => '화',
                                    'wed' => '수',
                                    'thu' => '목',
                                    'fri' => '금',
                                    'sat' => '토'
                                ),
                                'wide' => array(
                                    'sun' => '일요일',
                                    'mon' => '월요일',
                                    'tue' => '화요일',
                                    'wed' => '수요일',
                                    'thu' => '목요일',
                                    'fri' => '금요일',
                                    'sat' => '토요일'
                                )
                            )
                        ),
                        'quarters' => array(
                            'format' => array(
                                'abbreviated' => array(
                                    1 => '1분기',
                                    2 => '2분기',
                                    3 => '3분기',
                                    4 => '4분기'
                                ),
                                'narrow' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4'
                                ),
                                'wide' => array(
                                    1 => '제 1/4분기',
                                    2 => '제 2/4분기',
                                    3 => '제 3/4분기',
                                    4 => '제 4/4분기'
                                )
                            ),
                            'stand-alone' => array(
                                'abbreviated' => array(
                                    1 => '1분기',
                                    2 => '2분기',
                                    3 => '3분기',
                                    4 => '4분기'
                                ),
                                'narrow' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4'
                                ),
                                'wide' => array(
                                    1 => '제 1/4분기',
                                    2 => '제 2/4분기',
                                    3 => '제 3/4분기',
                                    4 => '제 4/4분기'
                                )
                            )
                        ),
                        'dayPeriods' => array(
                            'format' => array(
                                'abbreviated' => array(
                                    'am' => '오전',
                                    'pm' => '오후'
                                ),
                                'narrow' => array(
                                    'am' => '오전',
                                    'pm' => '오후'
                                ),
                                'wide' => array(
                                    'am' => '오전',
                                    'pm' => '오후'
                                )
                            ),
                            'stand-alone' => array(
                                'abbreviated' => array(
                                    'am' => '오전',
                                    'pm' => '오후'
                                ),
                                'narrow' => array(
                                    'am' => '오전',
                                    'pm' => '오후'
                                ),
                                'wide' => array(
                                    'am' => '오전',
                                    'pm' => '오후'
                                )
                            )
                        ),
                        'cyclicNameSets' => array(
                            'dayParts' => array(
                                'format' => array(
                                    'abbreviated' => array(
                                        1 => 'zi',
                                        2 => 'chou',
                                        3 => 'yin',
                                        4 => 'mao',
                                        5 => 'chen',
                                        6 => 'si',
                                        7 => 'wu',
                                        8 => 'wei',
                                        9 => 'shen',
                                        10 => 'you',
                                        11 => 'xu',
                                        12 => 'hai'
                                    ),
                                    'narrow' => array(
                                        1 => 'zi',
                                        2 => 'chou',
                                        3 => 'yin',
                                        4 => 'mao',
                                        5 => 'chen',
                                        6 => 'si',
                                        7 => 'wu',
                                        8 => 'wei',
                                        9 => 'shen',
                                        10 => 'you',
                                        11 => 'xu',
                                        12 => 'hai'
                                    ),
                                    'wide' => array(
                                        1 => 'zi',
                                        2 => 'chou',
                                        3 => 'yin',
                                        4 => 'mao',
                                        5 => 'chen',
                                        6 => 'si',
                                        7 => 'wu',
                                        8 => 'wei',
                                        9 => 'shen',
                                        10 => 'you',
                                        11 => 'xu',
                                        12 => 'hai'
                                    )
                                )
                            ),
                            'days' => array(
                                'format' => array(
                                    'abbreviated' => array(
                                        1 => '갑자',
                                        2 => '을축',
                                        3 => '병인',
                                        4 => '정묘',
                                        5 => '무진',
                                        6 => '기사',
                                        7 => '경오',
                                        8 => '신미',
                                        9 => '임신',
                                        10 => '계유',
                                        11 => '갑술',
                                        12 => '을해',
                                        13 => '병자',
                                        14 => '정축',
                                        15 => '무인',
                                        16 => '기묘',
                                        17 => '경진',
                                        18 => '신사',
                                        19 => '임오',
                                        20 => '계미',
                                        21 => '갑신',
                                        22 => '을유',
                                        23 => '병술',
                                        24 => '정해',
                                        25 => '무자',
                                        26 => '기축',
                                        27 => '경인',
                                        28 => '신묘',
                                        29 => '임진',
                                        30 => '계사',
                                        31 => '갑오',
                                        32 => '을미',
                                        33 => '병신',
                                        34 => '정유',
                                        35 => '무술',
                                        36 => '기해',
                                        37 => '경자',
                                        38 => '신축',
                                        39 => '임인',
                                        40 => '계묘',
                                        41 => '갑진',
                                        42 => '을사',
                                        43 => '병오',
                                        44 => '정미',
                                        45 => '무신',
                                        46 => '기유',
                                        47 => '경술',
                                        48 => '신해',
                                        49 => '임자',
                                        50 => '계축',
                                        51 => '갑인',
                                        52 => '을묘',
                                        53 => '병진',
                                        54 => '정사',
                                        55 => '무오',
                                        56 => '기미',
                                        57 => '경신',
                                        58 => '신유',
                                        59 => '임술',
                                        60 => '계해'
                                    ),
                                    'narrow' => array(
                                        1 => '갑자',
                                        2 => '을축',
                                        3 => '병인',
                                        4 => '정묘',
                                        5 => '무진',
                                        6 => '기사',
                                        7 => '경오',
                                        8 => '신미',
                                        9 => '임신',
                                        10 => '계유',
                                        11 => '갑술',
                                        12 => '을해',
                                        13 => '병자',
                                        14 => '정축',
                                        15 => '무인',
                                        16 => '기묘',
                                        17 => '경진',
                                        18 => '신사',
                                        19 => '임오',
                                        20 => '계미',
                                        21 => '갑신',
                                        22 => '을유',
                                        23 => '병술',
                                        24 => '정해',
                                        25 => '무자',
                                        26 => '기축',
                                        27 => '경인',
                                        28 => '신묘',
                                        29 => '임진',
                                        30 => '계사',
                                        31 => '갑오',
                                        32 => '을미',
                                        33 => '병신',
                                        34 => '정유',
                                        35 => '무술',
                                        36 => '기해',
                                        37 => '경자',
                                        38 => '신축',
                                        39 => '임인',
                                        40 => '계묘',
                                        41 => '갑진',
                                        42 => '을사',
                                        43 => '병오',
                                        44 => '정미',
                                        45 => '무신',
                                        46 => '기유',
                                        47 => '경술',
                                        48 => '신해',
                                        49 => '임자',
                                        50 => '계축',
                                        51 => '갑인',
                                        52 => '을묘',
                                        53 => '병진',
                                        54 => '정사',
                                        55 => '무오',
                                        56 => '기미',
                                        57 => '경신',
                                        58 => '신유',
                                        59 => '임술',
                                        60 => '계해'
                                    ),
                                    'wide' => array(
                                        1 => '갑자',
                                        2 => '을축',
                                        3 => '병인',
                                        4 => '정묘',
                                        5 => '무진',
                                        6 => '기사',
                                        7 => '경오',
                                        8 => '신미',
                                        9 => '임신',
                                        10 => '계유',
                                        11 => '갑술',
                                        12 => '을해',
                                        13 => '병자',
                                        14 => '정축',
                                        15 => '무인',
                                        16 => '기묘',
                                        17 => '경진',
                                        18 => '신사',
                                        19 => '임오',
                                        20 => '계미',
                                        21 => '갑신',
                                        22 => '을유',
                                        23 => '병술',
                                        24 => '정해',
                                        25 => '무자',
                                        26 => '기축',
                                        27 => '경인',
                                        28 => '신묘',
                                        29 => '임진',
                                        30 => '계사',
                                        31 => '갑오',
                                        32 => '을미',
                                        33 => '병신',
                                        34 => '정유',
                                        35 => '무술',
                                        36 => '기해',
                                        37 => '경자',
                                        38 => '신축',
                                        39 => '임인',
                                        40 => '계묘',
                                        41 => '갑진',
                                        42 => '을사',
                                        43 => '병오',
                                        44 => '정미',
                                        45 => '무신',
                                        46 => '기유',
                                        47 => '경술',
                                        48 => '신해',
                                        49 => '임자',
                                        50 => '계축',
                                        51 => '갑인',
                                        52 => '을묘',
                                        53 => '병진',
                                        54 => '정사',
                                        55 => '무오',
                                        56 => '기미',
                                        57 => '경신',
                                        58 => '신유',
                                        59 => '임술',
                                        60 => '계해'
                                    )
                                )
                            ),
                            'months' => array(
                                'format' => array(
                                    'abbreviated' => array(
                                        1 => '갑자',
                                        2 => '을축',
                                        3 => '병인',
                                        4 => '정묘',
                                        5 => '무진',
                                        6 => '기사',
                                        7 => '경오',
                                        8 => '신미',
                                        9 => '임신',
                                        10 => '계유',
                                        11 => '갑술',
                                        12 => '을해',
                                        13 => '병자',
                                        14 => '정축',
                                        15 => '무인',
                                        16 => '기묘',
                                        17 => '경진',
                                        18 => '신사',
                                        19 => '임오',
                                        20 => '계미',
                                        21 => '갑신',
                                        22 => '을유',
                                        23 => '병술',
                                        24 => '정해',
                                        25 => '무자',
                                        26 => '기축',
                                        27 => '경인',
                                        28 => '신묘',
                                        29 => '임진',
                                        30 => '계사',
                                        31 => '갑오',
                                        32 => '을미',
                                        33 => '병신',
                                        34 => '정유',
                                        35 => '무술',
                                        36 => '기해',
                                        37 => '경자',
                                        38 => '신축',
                                        39 => '임인',
                                        40 => '계묘',
                                        41 => '갑진',
                                        42 => '을사',
                                        43 => '병오',
                                        44 => '정미',
                                        45 => '무신',
                                        46 => '기유',
                                        47 => '경술',
                                        48 => '신해',
                                        49 => '임자',
                                        50 => '계축',
                                        51 => '갑인',
                                        52 => '을묘',
                                        53 => '병진',
                                        54 => '정사',
                                        55 => '무오',
                                        56 => '기미',
                                        57 => '경신',
                                        58 => '신유',
                                        59 => '임술',
                                        60 => '계해'
                                    ),
                                    'narrow' => array(
                                        1 => '갑자',
                                        2 => '을축',
                                        3 => '병인',
                                        4 => '정묘',
                                        5 => '무진',
                                        6 => '기사',
                                        7 => '경오',
                                        8 => '신미',
                                        9 => '임신',
                                        10 => '계유',
                                        11 => '갑술',
                                        12 => '을해',
                                        13 => '병자',
                                        14 => '정축',
                                        15 => '무인',
                                        16 => '기묘',
                                        17 => '경진',
                                        18 => '신사',
                                        19 => '임오',
                                        20 => '계미',
                                        21 => '갑신',
                                        22 => '을유',
                                        23 => '병술',
                                        24 => '정해',
                                        25 => '무자',
                                        26 => '기축',
                                        27 => '경인',
                                        28 => '신묘',
                                        29 => '임진',
                                        30 => '계사',
                                        31 => '갑오',
                                        32 => '을미',
                                        33 => '병신',
                                        34 => '정유',
                                        35 => '무술',
                                        36 => '기해',
                                        37 => '경자',
                                        38 => '신축',
                                        39 => '임인',
                                        40 => '계묘',
                                        41 => '갑진',
                                        42 => '을사',
                                        43 => '병오',
                                        44 => '정미',
                                        45 => '무신',
                                        46 => '기유',
                                        47 => '경술',
                                        48 => '신해',
                                        49 => '임자',
                                        50 => '계축',
                                        51 => '갑인',
                                        52 => '을묘',
                                        53 => '병진',
                                        54 => '정사',
                                        55 => '무오',
                                        56 => '기미',
                                        57 => '경신',
                                        58 => '신유',
                                        59 => '임술',
                                        60 => '계해'
                                    ),
                                    'wide' => array(
                                        1 => '갑자',
                                        2 => '을축',
                                        3 => '병인',
                                        4 => '정묘',
                                        5 => '무진',
                                        6 => '기사',
                                        7 => '경오',
                                        8 => '신미',
                                        9 => '임신',
                                        10 => '계유',
                                        11 => '갑술',
                                        12 => '을해',
                                        13 => '병자',
                                        14 => '정축',
                                        15 => '무인',
                                        16 => '기묘',
                                        17 => '경진',
                                        18 => '신사',
                                        19 => '임오',
                                        20 => '계미',
                                        21 => '갑신',
                                        22 => '을유',
                                        23 => '병술',
                                        24 => '정해',
                                        25 => '무자',
                                        26 => '기축',
                                        27 => '경인',
                                        28 => '신묘',
                                        29 => '임진',
                                        30 => '계사',
                                        31 => '갑오',
                                        32 => '을미',
                                        33 => '병신',
                                        34 => '정유',
                                        35 => '무술',
                                        36 => '기해',
                                        37 => '경자',
                                        38 => '신축',
                                        39 => '임인',
                                        40 => '계묘',
                                        41 => '갑진',
                                        42 => '을사',
                                        43 => '병오',
                                        44 => '정미',
                                        45 => '무신',
                                        46 => '기유',
                                        47 => '경술',
                                        48 => '신해',
                                        49 => '임자',
                                        50 => '계축',
                                        51 => '갑인',
                                        52 => '을묘',
                                        53 => '병진',
                                        54 => '정사',
                                        55 => '무오',
                                        56 => '기미',
                                        57 => '경신',
                                        58 => '신유',
                                        59 => '임술',
                                        60 => '계해'
                                    )
                                )
                            ),
                            'years' => array(
                                'format' => array(
                                    'abbreviated' => array(
                                        1 => '갑자',
                                        2 => '을축',
                                        3 => '병인',
                                        4 => '정묘',
                                        5 => '무진',
                                        6 => '기사',
                                        7 => '경오',
                                        8 => '신미',
                                        9 => '임신',
                                        10 => '계유',
                                        11 => '갑술',
                                        12 => '을해',
                                        13 => '병자',
                                        14 => '정축',
                                        15 => '무인',
                                        16 => '기묘',
                                        17 => '경진',
                                        18 => '신사',
                                        19 => '임오',
                                        20 => '계미',
                                        21 => '갑신',
                                        22 => '을유',
                                        23 => '병술',
                                        24 => '정해',
                                        25 => '무자',
                                        26 => '기축',
                                        27 => '경인',
                                        28 => '신묘',
                                        29 => '임진',
                                        30 => '계사',
                                        31 => '갑오',
                                        32 => '을미',
                                        33 => '병신',
                                        34 => '정유',
                                        35 => '무술',
                                        36 => '기해',
                                        37 => '경자',
                                        38 => '신축',
                                        39 => '임인',
                                        40 => '계묘',
                                        41 => '갑진',
                                        42 => '을사',
                                        43 => '병오',
                                        44 => '정미',
                                        45 => '무신',
                                        46 => '기유',
                                        47 => '경술',
                                        48 => '신해',
                                        49 => '임자',
                                        50 => '계축',
                                        51 => '갑인',
                                        52 => '을묘',
                                        53 => '병진',
                                        54 => '정사',
                                        55 => '무오',
                                        56 => '기미',
                                        57 => '경신',
                                        58 => '신유',
                                        59 => '임술',
                                        60 => '계해'
                                    ),
                                    'narrow' => array(
                                        1 => '갑자',
                                        2 => '을축',
                                        3 => '병인',
                                        4 => '정묘',
                                        5 => '무진',
                                        6 => '기사',
                                        7 => '경오',
                                        8 => '신미',
                                        9 => '임신',
                                        10 => '계유',
                                        11 => '갑술',
                                        12 => '을해',
                                        13 => '병자',
                                        14 => '정축',
                                        15 => '무인',
                                        16 => '기묘',
                                        17 => '경진',
                                        18 => '신사',
                                        19 => '임오',
                                        20 => '계미',
                                        21 => '갑신',
                                        22 => '을유',
                                        23 => '병술',
                                        24 => '정해',
                                        25 => '무자',
                                        26 => '기축',
                                        27 => '경인',
                                        28 => '신묘',
                                        29 => '임진',
                                        30 => '계사',
                                        31 => '갑오',
                                        32 => '을미',
                                        33 => '병신',
                                        34 => '정유',
                                        35 => '무술',
                                        36 => '기해',
                                        37 => '경자',
                                        38 => '신축',
                                        39 => '임인',
                                        40 => '계묘',
                                        41 => '갑진',
                                        42 => '을사',
                                        43 => '병오',
                                        44 => '정미',
                                        45 => '무신',
                                        46 => '기유',
                                        47 => '경술',
                                        48 => '신해',
                                        49 => '임자',
                                        50 => '계축',
                                        51 => '갑인',
                                        52 => '을묘',
                                        53 => '병진',
                                        54 => '정사',
                                        55 => '무오',
                                        56 => '기미',
                                        57 => '경신',
                                        58 => '신유',
                                        59 => '임술',
                                        60 => '계해'
                                    ),
                                    'wide' => array(
                                        1 => '갑자',
                                        2 => '을축',
                                        3 => '병인',
                                        4 => '정묘',
                                        5 => '무진',
                                        6 => '기사',
                                        7 => '경오',
                                        8 => '신미',
                                        9 => '임신',
                                        10 => '계유',
                                        11 => '갑술',
                                        12 => '을해',
                                        13 => '병자',
                                        14 => '정축',
                                        15 => '무인',
                                        16 => '기묘',
                                        17 => '경진',
                                        18 => '신사',
                                        19 => '임오',
                                        20 => '계미',
                                        21 => '갑신',
                                        22 => '을유',
                                        23 => '병술',
                                        24 => '정해',
                                        25 => '무자',
                                        26 => '기축',
                                        27 => '경인',
                                        28 => '신묘',
                                        29 => '임진',
                                        30 => '계사',
                                        31 => '갑오',
                                        32 => '을미',
                                        33 => '병신',
                                        34 => '정유',
                                        35 => '무술',
                                        36 => '기해',
                                        37 => '경자',
                                        38 => '신축',
                                        39 => '임인',
                                        40 => '계묘',
                                        41 => '갑진',
                                        42 => '을사',
                                        43 => '병오',
                                        44 => '정미',
                                        45 => '무신',
                                        46 => '기유',
                                        47 => '경술',
                                        48 => '신해',
                                        49 => '임자',
                                        50 => '계축',
                                        51 => '갑인',
                                        52 => '을묘',
                                        53 => '병진',
                                        54 => '정사',
                                        55 => '무오',
                                        56 => '기미',
                                        57 => '경신',
                                        58 => '신유',
                                        59 => '임술',
                                        60 => '계해'
                                    )
                                )
                            ),
                            'zodiacs' => array(
                                'format' => array(
                                    'abbreviated' => array(
                                        1 => 'zi',
                                        2 => 'chou',
                                        3 => 'yin',
                                        4 => 'mao',
                                        5 => 'chen',
                                        6 => 'si',
                                        7 => 'wu',
                                        8 => 'wei',
                                        9 => 'shen',
                                        10 => 'you',
                                        11 => 'xu',
                                        12 => 'hai'
                                    ),
                                    'narrow' => array(
                                        1 => 'zi',
                                        2 => 'chou',
                                        3 => 'yin',
                                        4 => 'mao',
                                        5 => 'chen',
                                        6 => 'si',
                                        7 => 'wu',
                                        8 => 'wei',
                                        9 => 'shen',
                                        10 => 'you',
                                        11 => 'xu',
                                        12 => 'hai'
                                    ),
                                    'wide' => array(
                                        1 => 'zi',
                                        2 => 'chou',
                                        3 => 'yin',
                                        4 => 'mao',
                                        5 => 'chen',
                                        6 => 'si',
                                        7 => 'wu',
                                        8 => 'wei',
                                        9 => 'shen',
                                        10 => 'you',
                                        11 => 'xu',
                                        12 => 'hai'
                                    )
                                )
                            )
                        ),
                        'dateFormats' => array(
                            'full' => 'U년 M월 d일 EEEE',
                            'long' => 'U년 M월 d일',
                            'medium' => 'y. M. d.',
                            'short' => 'y. M. d.'
                        ),
                        'timeFormats' => array(
                            'full' => 'a h시 m분 s초 zzzz',
                            'long' => 'a h시 m분 s초 z',
                            'medium' => 'a h:mm:ss',
                            'short' => 'a h:mm'
                        ),
                        'dateTimeFormats' => array(
                            'full' => '{1} {0}',
                            'long' => '{1} {0}',
                            'medium' => '{1} {0}',
                            'short' => '{1} {0}',
                            'availableFormats' => array(
                                'd' => 'd일',
                                'Ed' => 'd일 (E)',
                                'EEEEd' => 'd일 EEEE',
                                'Gy' => 'U년',
                                'GyMMM' => 'U년 MMM',
                                'GyMMMd' => 'U년 MMM d일',
                                'GyMMMEd' => 'U년 MMM d일 (E)',
                                'GyMMMEEEEd' => 'U년 MMM d일 EEEE',
                                'h' => 'a h시',
                                'H' => 'H시',
                                'hm' => 'a h:mm',
                                'Hm' => 'HH:mm',
                                'hms' => 'a h:mm:ss',
                                'Hms' => 'H시 m분 s초',
                                'M' => 'M월',
                                'Md' => 'M. d.',
                                'MEd' => 'M. d. (E)',
                                'MEEEEd' => 'M. d. EEEE',
                                'MMM' => 'LLL',
                                'MMMd' => 'MMM d일',
                                'MMMEd' => 'MMM d일 (E)',
                                'MMMEEEEd' => 'MMM d일 EEEE',
                                'ms' => 'mm:ss',
                                'y' => 'U년',
                                'yMd' => 'U. M. d.',
                                'yyyy' => 'U년',
                                'yyyyM' => 'U. M.',
                                'yyyyMd' => 'U. M. d.',
                                'yyyyMEd' => 'U. M. d. (E)',
                                'yyyyMEEEEd' => 'U. M. d. EEEE',
                                'yyyyMMM' => 'U년 MMM',
                                'yyyyMMMd' => 'U년 MMM d일',
                                'yyyyMMMEd' => 'U년 MMM d일 (E)',
                                'yyyyMMMEEEEd' => 'U년 MMM d일 EEEE',
                                'yyyyQQQ' => 'U년 QQQ',
                                'yyyyQQQQ' => 'U년 QQQQ'
                            ),
                            'appendItems' => array(
                                'Day' => '{0} ({2}: {1})',
                                'Day-Of-Week' => '{0} {1}',
                                'Era' => '{1} {0}',
                                'Hour' => '{0} ({2}: {1})',
                                'Minute' => '{0} ({2}: {1})',
                                'Month' => '{0} ({2}: {1})',
                                'Quarter' => '{0} ({2}: {1})',
                                'Second' => '{0} ({2}: {1})',
                                'Timezone' => '{0} {1}',
                                'Week' => '{0} ({2}: {1})',
                                'Year' => '{1} {0}'
                            ),
                            'intervalFormats' => array(
                                'intervalFormatFallback' => '{0} – {1}',
                                'd' => array(
                                    'd' => 'd–d'
                                ),
                                'h' => array(
                                    'a' => 'h a – h a',
                                    'h' => 'h–h a'
                                ),
                                'H' => array(
                                    'H' => 'HH–HH'
                                ),
                                'hm' => array(
                                    'a' => 'h:mm a – h:mm a',
                                    'h' => 'h:mm–h:mm a',
                                    'm' => 'h:mm–h:mm a'
                                ),
                                'Hm' => array(
                                    'H' => 'HH:mm–HH:mm',
                                    'm' => 'HH:mm–HH:mm'
                                ),
                                'hmv' => array(
                                    'a' => 'h:mm a – h:mm a v',
                                    'h' => 'h:mm–h:mm a v',
                                    'm' => 'h:mm–h:mm a v'
                                ),
                                'Hmv' => array(
                                    'H' => 'HH:mm–HH:mm v',
                                    'm' => 'HH:mm–HH:mm v'
                                ),
                                'hv' => array(
                                    'a' => 'h a – h a v',
                                    'h' => 'h–h a v'
                                ),
                                'Hv' => array(
                                    'H' => 'HH–HH v'
                                ),
                                'M' => array(
                                    'M' => 'MM–MM'
                                ),
                                'Md' => array(
                                    'd' => 'MM-dd – MM-dd',
                                    'M' => 'MM-dd – MM-dd'
                                ),
                                'MEd' => array(
                                    'd' => 'MM-dd, E – MM-dd, E',
                                    'M' => 'MM-dd, E – MM-dd, E'
                                ),
                                'MMM' => array(
                                    'M' => 'LLL–LLL'
                                ),
                                'MMMd' => array(
                                    'd' => 'MMM d–d',
                                    'M' => 'MMM d – MMM d'
                                ),
                                'MMMEd' => array(
                                    'd' => 'MMM d, E – MMM d, E',
                                    'M' => 'MMM d, E – MMM d, E'
                                ),
                                'y' => array(
                                    'y' => 'U–U'
                                ),
                                'yM' => array(
                                    'M' => 'y-MM – y-MM',
                                    'y' => 'y-MM – y-MM'
                                ),
                                'yMd' => array(
                                    'd' => 'y-MM-dd – y-MM-dd',
                                    'M' => 'y-MM-dd – y-MM-dd',
                                    'y' => 'y-MM-dd – y-MM-dd'
                                ),
                                'yMEd' => array(
                                    'd' => 'y-MM-dd, E – y-MM-dd, E',
                                    'M' => 'y-MM-dd, E – y-MM-dd, E',
                                    'y' => 'y-MM-dd, E – y-MM-dd, E'
                                ),
                                'yMMM' => array(
                                    'M' => 'U MMM–MMM',
                                    'y' => 'U MMM – U MMM'
                                ),
                                'yMMMd' => array(
                                    'd' => 'U MMM d–d',
                                    'M' => 'U MMM d – MMM d',
                                    'y' => 'U MMM d – U MMM d'
                                ),
                                'yMMMEd' => array(
                                    'd' => 'U MMM d, E – MMM d, E',
                                    'M' => 'U MMM d, E – MMM d, E',
                                    'y' => 'U MMM d, E – U MMM d, E'
                                ),
                                'yMMMM' => array(
                                    'M' => 'U MMMM–MMMM',
                                    'y' => 'U MMMM – U MMMM'
                                )
                            )
                        )
                    )
                )
            )
        )
    )
);

return $data;
