<?php
$data = array(
    'main' => array(
        'th' => array(
            'dates' => array(
                'calendars' => array(
                    'chinese' => array(
                        'months' => array(
                            'format' => array(
                                'abbreviated' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                                    6 => '6',
                                    7 => '7',
                                    8 => '8',
                                    9 => '9',
                                    10 => '10',
                                    11 => '11',
                                    12 => '12'
                                ),
                                'narrow' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                                    6 => '6',
                                    7 => '7',
                                    8 => '8',
                                    9 => '9',
                                    10 => '10',
                                    11 => '11',
                                    12 => '12'
                                ),
                                'wide' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                                    6 => '6',
                                    7 => '7',
                                    8 => '8',
                                    9 => '9',
                                    10 => '10',
                                    11 => '11',
                                    12 => '12'
                                )
                            ),
                            'stand-alone' => array(
                                'abbreviated' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                                    6 => '6',
                                    7 => '7',
                                    8 => '8',
                                    9 => '9',
                                    10 => '10',
                                    11 => '11',
                                    12 => '12'
                                ),
                                'narrow' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                                    6 => '6',
                                    7 => '7',
                                    8 => '8',
                                    9 => '9',
                                    10 => '10',
                                    11 => '11',
                                    12 => '12'
                                ),
                                'wide' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                                    6 => '6',
                                    7 => '7',
                                    8 => '8',
                                    9 => '9',
                                    10 => '10',
                                    11 => '11',
                                    12 => '12'
                                )
                            )
                        ),
                        'monthPatterns' => array(
                            'format' => array(
                                'abbreviated' => array(
                                    'leap' => '{0}bis'
                                ),
                                'narrow' => array(
                                    'leap' => '{0}b'
                                ),
                                'wide' => array(
                                    'leap' => '{0}bis'
                                )
                            ),
                            'numeric' => array(
                                'all' => array(
                                    'leap' => '{0}bis'
                                )
                            ),
                            'stand-alone' => array(
                                'abbreviated' => array(
                                    'leap' => '{0}bis'
                                ),
                                'narrow' => array(
                                    'leap' => '{0}b'
                                ),
                                'wide' => array(
                                    'leap' => '{0}bis'
                                )
                            )
                        ),
                        'days' => array(
                            'format' => array(
                                'abbreviated' => array(
                                    'sun' => 'อา.',
                                    'mon' => 'จ.',
                                    'tue' => 'อ.',
                                    'wed' => 'พ.',
                                    'thu' => 'พฤ.',
                                    'fri' => 'ศ.',
                                    'sat' => 'ส.'
                                ),
                                'narrow' => array(
                                    'sun' => 'อา.',
                                    'mon' => 'จ.',
                                    'tue' => 'อ.',
                                    'wed' => 'พ.',
                                    'thu' => 'พฤ.',
                                    'fri' => 'ศ.',
                                    'sat' => 'ส.'
                                ),
                                'short' => array(
                                    'sun' => 'อา.',
                                    'mon' => 'จ.',
                                    'tue' => 'อ.',
                                    'wed' => 'พ.',
                                    'thu' => 'พฤ.',
                                    'fri' => 'ศ.',
                                    'sat' => 'ส.'
                                ),
                                'wide' => array(
                                    'sun' => 'วันอาทิตย์',
                                    'mon' => 'วันจันทร์',
                                    'tue' => 'วันอังคาร',
                                    'wed' => 'วันพุธ',
                                    'thu' => 'วันพฤหัสบดี',
                                    'fri' => 'วันศุกร์',
                                    'sat' => 'วันเสาร์'
                                )
                            ),
                            'stand-alone' => array(
                                'abbreviated' => array(
                                    'sun' => 'อา.',
                                    'mon' => 'จ.',
                                    'tue' => 'อ.',
                                    'wed' => 'พ.',
                                    'thu' => 'พฤ.',
                                    'fri' => 'ศ.',
                                    'sat' => 'ส.'
                                ),
                                'narrow' => array(
                                    'sun' => 'อา.',
                                    'mon' => 'จ.',
                                    'tue' => 'อ.',
                                    'wed' => 'พ.',
                                    'thu' => 'พฤ.',
                                    'fri' => 'ศ.',
                                    'sat' => 'ส.'
                                ),
                                'short' => array(
                                    'sun' => 'อา.',
                                    'mon' => 'จ.',
                                    'tue' => 'อ.',
                                    'wed' => 'พ.',
                                    'thu' => 'พฤ.',
                                    'fri' => 'ศ.',
                                    'sat' => 'ส.'
                                ),
                                'wide' => array(
                                    'sun' => 'วันอาทิตย์',
                                    'mon' => 'วันจันทร์',
                                    'tue' => 'วันอังคาร',
                                    'wed' => 'วันพุธ',
                                    'thu' => 'วันพฤหัสบดี',
                                    'fri' => 'วันศุกร์',
                                    'sat' => 'วันเสาร์'
                                )
                            )
                        ),
                        'quarters' => array(
                            'format' => array(
                                'abbreviated' => array(
                                    1 => 'ไตรมาส 1',
                                    2 => 'ไตรมาส 2',
                                    3 => 'ไตรมาส 3',
                                    4 => 'ไตรมาส 4'
                                ),
                                'narrow' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4'
                                ),
                                'wide' => array(
                                    1 => 'ไตรมาส 1',
                                    2 => 'ไตรมาส 2',
                                    3 => 'ไตรมาส 3',
                                    4 => 'ไตรมาส 4'
                                )
                            ),
                            'stand-alone' => array(
                                'abbreviated' => array(
                                    1 => 'ไตรมาส 1',
                                    2 => 'ไตรมาส 2',
                                    3 => 'ไตรมาส 3',
                                    4 => 'ไตรมาส 4'
                                ),
                                'narrow' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4'
                                ),
                                'wide' => array(
                                    1 => 'ไตรมาส 1',
                                    2 => 'ไตรมาส 2',
                                    3 => 'ไตรมาส 3',
                                    4 => 'ไตรมาส 4'
                                )
                            )
                        ),
                        'dayPeriods' => array(
                            'format' => array(
                                'abbreviated' => array(
                                    'am' => 'ก่อนเที่ยง',
                                    'pm' => 'หลังเที่ยง'
                                ),
                                'narrow' => array(
                                    'am' => 'ก่อนเที่ยง',
                                    'pm' => 'หลังเที่ยง'
                                ),
                                'wide' => array(
                                    'am' => 'ก่อนเที่ยง',
                                    'pm' => 'หลังเที่ยง'
                                )
                            ),
                            'stand-alone' => array(
                                'abbreviated' => array(
                                    'am' => 'ก่อนเที่ยง',
                                    'pm' => 'หลังเที่ยง'
                                ),
                                'narrow' => array(
                                    'am' => 'ก่อนเที่ยง',
                                    'pm' => 'หลังเที่ยง'
                                ),
                                'wide' => array(
                                    'am' => 'ก่อนเที่ยง',
                                    'pm' => 'หลังเที่ยง'
                                )
                            )
                        ),
                        'cyclicNameSets' => array(
                            'dayParts' => array(
                                'format' => array(
                                    'abbreviated' => array(
                                        1 => 'จื่อ',
                                        2 => 'โฉ่ว',
                                        3 => 'อิ๋น',
                                        4 => 'เหม่า',
                                        5 => 'เฉิน',
                                        6 => 'ซื่อ',
                                        7 => 'อู้',
                                        8 => 'เว่ย',
                                        9 => 'เซิน',
                                        10 => 'โหย่ว',
                                        11 => 'ซู',
                                        12 => 'ฮ่าย'
                                    ),
                                    'narrow' => array(
                                        1 => 'จื่อ',
                                        2 => 'โฉ่ว',
                                        3 => 'อิ๋น',
                                        4 => 'เหม่า',
                                        5 => 'เฉิน',
                                        6 => 'ซื่อ',
                                        7 => 'อู้',
                                        8 => 'เว่ย',
                                        9 => 'เซิน',
                                        10 => 'โหย่ว',
                                        11 => 'ซู',
                                        12 => 'ฮ่าย'
                                    ),
                                    'wide' => array(
                                        1 => 'จื่อ',
                                        2 => 'โฉ่ว',
                                        3 => 'อิ๋น',
                                        4 => 'เหม่า',
                                        5 => 'เฉิน',
                                        6 => 'ซื่อ',
                                        7 => 'อู้',
                                        8 => 'เว่ย',
                                        9 => 'เซิน',
                                        10 => 'โหย่ว',
                                        11 => 'ซู',
                                        12 => 'ฮ่าย'
                                    )
                                )
                            ),
                            'days' => array(
                                'format' => array(
                                    'abbreviated' => array(
                                        1 => 'เจี่ยจื่อ',
                                        2 => 'อี๋โฉ่ว',
                                        3 => 'ปิ่งอิ๋น',
                                        4 => 'ติงเหม่า',
                                        5 => 'อู้เฉิน',
                                        6 => 'จี่ซื่อ',
                                        7 => 'เกิงอู้',
                                        8 => 'ซินเว่ย',
                                        9 => 'เหรินเซิน',
                                        10 => 'กุุ๋่ยโหย่ว',
                                        11 => 'เจ่ียซู',
                                        12 => 'อี๋ฮ่าย',
                                        13 => 'ปิ๋ิ่งจื่อ',
                                        14 => 'ติงโฉ่ว',
                                        15 => 'อู้อิ๋น',
                                        16 => 'จี๋เหม่า',
                                        17 => 'เกิงเฉิน',
                                        18 => 'ซินซื่อ',
                                        19 => 'เหรินอู้',
                                        20 => 'กุ่ยเว่ย',
                                        21 => 'เจี่ยเซิน',
                                        22 => 'อี๋โหย่ว',
                                        23 => 'ปิ่งซู',
                                        24 => 'ติงฮ่าย',
                                        25 => 'อู้จื่อ',
                                        26 => 'จี๋โฉ่ว',
                                        27 => 'เกิงอิ๋น',
                                        28 => 'ซินเหม่า',
                                        29 => 'เหรินเฉิน',
                                        30 => 'กุ่ยซ่อ',
                                        31 => 'เจ่ียอู้',
                                        32 => 'อี่เว่ย',
                                        33 => 'ป่ิงเซิน',
                                        34 => 'ติงโหย่ว',
                                        35 => 'อู้ซู',
                                        36 => 'จี่ฮ่าย',
                                        37 => 'เกิงจื่อ',
                                        38 => 'ซินโฉ่ว',
                                        39 => 'เหรินอิ๋น',
                                        40 => 'กุ๋ยเหม่า',
                                        41 => 'เจี่ยเฉิน',
                                        42 => 'อี่ซ่ือ',
                                        43 => 'ป่ิงอู้',
                                        44 => 'ติงเว่ย',
                                        45 => 'อู้เซิน',
                                        46 => 'จี๋โหย่ว',
                                        47 => 'เกิงซู',
                                        48 => 'ซินฮ่าย',
                                        49 => 'เหรินจ่ือ',
                                        50 => 'กุุ๋่ยโฉ่ว',
                                        51 => 'เจี่ยอิ๋น',
                                        52 => 'อ๋ีเหม่า',
                                        53 => 'ปิ่งเฉิน',
                                        54 => 'ติงซื่อ',
                                        55 => 'อู้อู้',
                                        56 => 'จ่ีเว่ย',
                                        57 => 'เกิงเซิน',
                                        58 => 'ซินโหย่ว',
                                        59 => 'เหรินซู',
                                        60 => 'กุ่ยฮ่าย'
                                    ),
                                    'narrow' => array(
                                        1 => 'เจี่ยจื่อ',
                                        2 => 'อี๋โฉ่ว',
                                        3 => 'ปิ่งอิ๋น',
                                        4 => 'ติงเหม่า',
                                        5 => 'อู้เฉิน',
                                        6 => 'จี่ซื่อ',
                                        7 => 'เกิงอู้',
                                        8 => 'ซินเว่ย',
                                        9 => 'เหรินเซิน',
                                        10 => 'กุุ๋่ยโหย่ว',
                                        11 => 'เจ่ียซู',
                                        12 => 'อี๋ฮ่าย',
                                        13 => 'ปิ๋ิ่งจื่อ',
                                        14 => 'ติงโฉ่ว',
                                        15 => 'อู้อิ๋น',
                                        16 => 'จี๋เหม่า',
                                        17 => 'เกิงเฉิน',
                                        18 => 'ซินซื่อ',
                                        19 => 'เหรินอู้',
                                        20 => 'กุ่ยเว่ย',
                                        21 => 'เจี่ยเซิน',
                                        22 => 'อี๋โหย่ว',
                                        23 => 'ปิ่งซู',
                                        24 => 'ติงฮ่าย',
                                        25 => 'อู้จื่อ',
                                        26 => 'จี๋โฉ่ว',
                                        27 => 'เกิงอิ๋น',
                                        28 => 'ซินเหม่า',
                                        29 => 'เหรินเฉิน',
                                        30 => 'กุ่ยซ่อ',
                                        31 => 'เจ่ียอู้',
                                        32 => 'อี่เว่ย',
                                        33 => 'ป่ิงเซิน',
                                        34 => 'ติงโหย่ว',
                                        35 => 'อู้ซู',
                                        36 => 'จี่ฮ่าย',
                                        37 => 'เกิงจื่อ',
                                        38 => 'ซินโฉ่ว',
                                        39 => 'เหรินอิ๋น',
                                        40 => 'กุ๋ยเหม่า',
                                        41 => 'เจี่ยเฉิน',
                                        42 => 'อี่ซ่ือ',
                                        43 => 'ป่ิงอู้',
                                        44 => 'ติงเว่ย',
                                        45 => 'อู้เซิน',
                                        46 => 'จี๋โหย่ว',
                                        47 => 'เกิงซู',
                                        48 => 'ซินฮ่าย',
                                        49 => 'เหรินจ่ือ',
                                        50 => 'กุุ๋่ยโฉ่ว',
                                        51 => 'เจี่ยอิ๋น',
                                        52 => 'อ๋ีเหม่า',
                                        53 => 'ปิ่งเฉิน',
                                        54 => 'ติงซื่อ',
                                        55 => 'อู้อู้',
                                        56 => 'จ่ีเว่ย',
                                        57 => 'เกิงเซิน',
                                        58 => 'ซินโหย่ว',
                                        59 => 'เหรินซู',
                                        60 => 'กุ่ยฮ่าย'
                                    ),
                                    'wide' => array(
                                        1 => 'เจี่ยจื่อ',
                                        2 => 'อี๋โฉ่ว',
                                        3 => 'ปิ่งอิ๋น',
                                        4 => 'ติงเหม่า',
                                        5 => 'อู้เฉิน',
                                        6 => 'จี่ซื่อ',
                                        7 => 'เกิงอู้',
                                        8 => 'ซินเว่ย',
                                        9 => 'เหรินเซิน',
                                        10 => 'กุุ๋่ยโหย่ว',
                                        11 => 'เจ่ียซู',
                                        12 => 'อี๋ฮ่าย',
                                        13 => 'ปิ๋ิ่งจื่อ',
                                        14 => 'ติงโฉ่ว',
                                        15 => 'อู้อิ๋น',
                                        16 => 'จี๋เหม่า',
                                        17 => 'เกิงเฉิน',
                                        18 => 'ซินซื่อ',
                                        19 => 'เหรินอู้',
                                        20 => 'กุ่ยเว่ย',
                                        21 => 'เจี่ยเซิน',
                                        22 => 'อี๋โหย่ว',
                                        23 => 'ปิ่งซู',
                                        24 => 'ติงฮ่าย',
                                        25 => 'อู้จื่อ',
                                        26 => 'จี๋โฉ่ว',
                                        27 => 'เกิงอิ๋น',
                                        28 => 'ซินเหม่า',
                                        29 => 'เหรินเฉิน',
                                        30 => 'กุ่ยซ่อ',
                                        31 => 'เจ่ียอู้',
                                        32 => 'อี่เว่ย',
                                        33 => 'ป่ิงเซิน',
                                        34 => 'ติงโหย่ว',
                                        35 => 'อู้ซู',
                                        36 => 'จี่ฮ่าย',
                                        37 => 'เกิงจื่อ',
                                        38 => 'ซินโฉ่ว',
                                        39 => 'เหรินอิ๋น',
                                        40 => 'กุ๋ยเหม่า',
                                        41 => 'เจี่ยเฉิน',
                                        42 => 'อี่ซ่ือ',
                                        43 => 'ป่ิงอู้',
                                        44 => 'ติงเว่ย',
                                        45 => 'อู้เซิน',
                                        46 => 'จี๋โหย่ว',
                                        47 => 'เกิงซู',
                                        48 => 'ซินฮ่าย',
                                        49 => 'เหรินจ่ือ',
                                        50 => 'กุุ๋่ยโฉ่ว',
                                        51 => 'เจี่ยอิ๋น',
                                        52 => 'อ๋ีเหม่า',
                                        53 => 'ปิ่งเฉิน',
                                        54 => 'ติงซื่อ',
                                        55 => 'อู้อู้',
                                        56 => 'จ่ีเว่ย',
                                        57 => 'เกิงเซิน',
                                        58 => 'ซินโหย่ว',
                                        59 => 'เหรินซู',
                                        60 => 'กุ่ยฮ่าย'
                                    )
                                )
                            ),
                            'months' => array(
                                'format' => array(
                                    'abbreviated' => array(
                                        1 => 'เจี่ยจื่อ',
                                        2 => 'อี๋โฉ่ว',
                                        3 => 'ปิ่งอิ๋น',
                                        4 => 'ติงเหม่า',
                                        5 => 'อู้เฉิน',
                                        6 => 'จี่ซื่อ',
                                        7 => 'เกิงอู้',
                                        8 => 'ซินเว่ย',
                                        9 => 'เหรินเซิน',
                                        10 => 'กุุ๋่ยโหย่ว',
                                        11 => 'เจ่ียซู',
                                        12 => 'อี๋ฮ่าย',
                                        13 => 'ปิ๋ิ่งจื่อ',
                                        14 => 'ติงโฉ่ว',
                                        15 => 'อู้อิ๋น',
                                        16 => 'จี๋เหม่า',
                                        17 => 'เกิงเฉิน',
                                        18 => 'ซินซื่อ',
                                        19 => 'เหรินอู้',
                                        20 => 'กุ่ยเว่ย',
                                        21 => 'เจี่ยเซิน',
                                        22 => 'อี๋โหย่ว',
                                        23 => 'ปิ่งซู',
                                        24 => 'ติงฮ่าย',
                                        25 => 'อู้จื่อ',
                                        26 => 'จี๋โฉ่ว',
                                        27 => 'เกิงอิ๋น',
                                        28 => 'ซินเหม่า',
                                        29 => 'เหรินเฉิน',
                                        30 => 'กุ่ยซ่อ',
                                        31 => 'เจ่ียอู้',
                                        32 => 'อี่เว่ย',
                                        33 => 'ป่ิงเซิน',
                                        34 => 'ติงโหย่ว',
                                        35 => 'อู้ซู',
                                        36 => 'จี่ฮ่าย',
                                        37 => 'เกิงจื่อ',
                                        38 => 'ซินโฉ่ว',
                                        39 => 'เหรินอิ๋น',
                                        40 => 'กุ๋ยเหม่า',
                                        41 => 'เจี่ยเฉิน',
                                        42 => 'อี่ซ่ือ',
                                        43 => 'ป่ิงอู้',
                                        44 => 'ติงเว่ย',
                                        45 => 'อู้เซิน',
                                        46 => 'จี๋โหย่ว',
                                        47 => 'เกิงซู',
                                        48 => 'ซินฮ่าย',
                                        49 => 'เหรินจ่ือ',
                                        50 => 'กุุ๋่ยโฉ่ว',
                                        51 => 'เจี่ยอิ๋น',
                                        52 => 'อ๋ีเหม่า',
                                        53 => 'ปิ่งเฉิน',
                                        54 => 'ติงซื่อ',
                                        55 => 'อู้อู้',
                                        56 => 'จ่ีเว่ย',
                                        57 => 'เกิงเซิน',
                                        58 => 'ซินโหย่ว',
                                        59 => 'เหรินซู',
                                        60 => 'กุ่ยฮ่าย'
                                    ),
                                    'narrow' => array(
                                        1 => 'เจี่ยจื่อ',
                                        2 => 'อี๋โฉ่ว',
                                        3 => 'ปิ่งอิ๋น',
                                        4 => 'ติงเหม่า',
                                        5 => 'อู้เฉิน',
                                        6 => 'จี่ซื่อ',
                                        7 => 'เกิงอู้',
                                        8 => 'ซินเว่ย',
                                        9 => 'เหรินเซิน',
                                        10 => 'กุุ๋่ยโหย่ว',
                                        11 => 'เจ่ียซู',
                                        12 => 'อี๋ฮ่าย',
                                        13 => 'ปิ๋ิ่งจื่อ',
                                        14 => 'ติงโฉ่ว',
                                        15 => 'อู้อิ๋น',
                                        16 => 'จี๋เหม่า',
                                        17 => 'เกิงเฉิน',
                                        18 => 'ซินซื่อ',
                                        19 => 'เหรินอู้',
                                        20 => 'กุ่ยเว่ย',
                                        21 => 'เจี่ยเซิน',
                                        22 => 'อี๋โหย่ว',
                                        23 => 'ปิ่งซู',
                                        24 => 'ติงฮ่าย',
                                        25 => 'อู้จื่อ',
                                        26 => 'จี๋โฉ่ว',
                                        27 => 'เกิงอิ๋น',
                                        28 => 'ซินเหม่า',
                                        29 => 'เหรินเฉิน',
                                        30 => 'กุ่ยซ่อ',
                                        31 => 'เจ่ียอู้',
                                        32 => 'อี่เว่ย',
                                        33 => 'ป่ิงเซิน',
                                        34 => 'ติงโหย่ว',
                                        35 => 'อู้ซู',
                                        36 => 'จี่ฮ่าย',
                                        37 => 'เกิงจื่อ',
                                        38 => 'ซินโฉ่ว',
                                        39 => 'เหรินอิ๋น',
                                        40 => 'กุ๋ยเหม่า',
                                        41 => 'เจี่ยเฉิน',
                                        42 => 'อี่ซ่ือ',
                                        43 => 'ป่ิงอู้',
                                        44 => 'ติงเว่ย',
                                        45 => 'อู้เซิน',
                                        46 => 'จี๋โหย่ว',
                                        47 => 'เกิงซู',
                                        48 => 'ซินฮ่าย',
                                        49 => 'เหรินจ่ือ',
                                        50 => 'กุุ๋่ยโฉ่ว',
                                        51 => 'เจี่ยอิ๋น',
                                        52 => 'อ๋ีเหม่า',
                                        53 => 'ปิ่งเฉิน',
                                        54 => 'ติงซื่อ',
                                        55 => 'อู้อู้',
                                        56 => 'จ่ีเว่ย',
                                        57 => 'เกิงเซิน',
                                        58 => 'ซินโหย่ว',
                                        59 => 'เหรินซู',
                                        60 => 'กุ่ยฮ่าย'
                                    ),
                                    'wide' => array(
                                        1 => 'เจี่ยจื่อ',
                                        2 => 'อี๋โฉ่ว',
                                        3 => 'ปิ่งอิ๋น',
                                        4 => 'ติงเหม่า',
                                        5 => 'อู้เฉิน',
                                        6 => 'จี่ซื่อ',
                                        7 => 'เกิงอู้',
                                        8 => 'ซินเว่ย',
                                        9 => 'เหรินเซิน',
                                        10 => 'กุุ๋่ยโหย่ว',
                                        11 => 'เจ่ียซู',
                                        12 => 'อี๋ฮ่าย',
                                        13 => 'ปิ๋ิ่งจื่อ',
                                        14 => 'ติงโฉ่ว',
                                        15 => 'อู้อิ๋น',
                                        16 => 'จี๋เหม่า',
                                        17 => 'เกิงเฉิน',
                                        18 => 'ซินซื่อ',
                                        19 => 'เหรินอู้',
                                        20 => 'กุ่ยเว่ย',
                                        21 => 'เจี่ยเซิน',
                                        22 => 'อี๋โหย่ว',
                                        23 => 'ปิ่งซู',
                                        24 => 'ติงฮ่าย',
                                        25 => 'อู้จื่อ',
                                        26 => 'จี๋โฉ่ว',
                                        27 => 'เกิงอิ๋น',
                                        28 => 'ซินเหม่า',
                                        29 => 'เหรินเฉิน',
                                        30 => 'กุ่ยซ่อ',
                                        31 => 'เจ่ียอู้',
                                        32 => 'อี่เว่ย',
                                        33 => 'ป่ิงเซิน',
                                        34 => 'ติงโหย่ว',
                                        35 => 'อู้ซู',
                                        36 => 'จี่ฮ่าย',
                                        37 => 'เกิงจื่อ',
                                        38 => 'ซินโฉ่ว',
                                        39 => 'เหรินอิ๋น',
                                        40 => 'กุ๋ยเหม่า',
                                        41 => 'เจี่ยเฉิน',
                                        42 => 'อี่ซ่ือ',
                                        43 => 'ป่ิงอู้',
                                        44 => 'ติงเว่ย',
                                        45 => 'อู้เซิน',
                                        46 => 'จี๋โหย่ว',
                                        47 => 'เกิงซู',
                                        48 => 'ซินฮ่าย',
                                        49 => 'เหรินจ่ือ',
                                        50 => 'กุุ๋่ยโฉ่ว',
                                        51 => 'เจี่ยอิ๋น',
                                        52 => 'อ๋ีเหม่า',
                                        53 => 'ปิ่งเฉิน',
                                        54 => 'ติงซื่อ',
                                        55 => 'อู้อู้',
                                        56 => 'จ่ีเว่ย',
                                        57 => 'เกิงเซิน',
                                        58 => 'ซินโหย่ว',
                                        59 => 'เหรินซู',
                                        60 => 'กุ่ยฮ่าย'
                                    )
                                )
                            ),
                            'years' => array(
                                'format' => array(
                                    'abbreviated' => array(
                                        1 => 'เจี่ยจื่อ',
                                        2 => 'อี๋โฉ่ว',
                                        3 => 'ปิ่งอิ๋น',
                                        4 => 'ติงเหม่า',
                                        5 => 'อู้เฉิน',
                                        6 => 'จี่ซื่อ',
                                        7 => 'เกิงอู้',
                                        8 => 'ซินเว่ย',
                                        9 => 'เหรินเซิน',
                                        10 => 'กุุ๋่ยโหย่ว',
                                        11 => 'เจ่ียซู',
                                        12 => 'อี๋ฮ่าย',
                                        13 => 'ปิ๋ิ่งจื่อ',
                                        14 => 'ติงโฉ่ว',
                                        15 => 'อู้อิ๋น',
                                        16 => 'จี๋เหม่า',
                                        17 => 'เกิงเฉิน',
                                        18 => 'ซินซื่อ',
                                        19 => 'เหรินอู้',
                                        20 => 'กุ่ยเว่ย',
                                        21 => 'เจี่ยเซิน',
                                        22 => 'อี๋โหย่ว',
                                        23 => 'ปิ่งซู',
                                        24 => 'ติงฮ่าย',
                                        25 => 'อู้จื่อ',
                                        26 => 'จี๋โฉ่ว',
                                        27 => 'เกิงอิ๋น',
                                        28 => 'ซินเหม่า',
                                        29 => 'เหรินเฉิน',
                                        30 => 'กุ่ยซ่อ',
                                        31 => 'เจ่ียอู้',
                                        32 => 'อี่เว่ย',
                                        33 => 'ป่ิงเซิน',
                                        34 => 'ติงโหย่ว',
                                        35 => 'อู้ซู',
                                        36 => 'จี่ฮ่าย',
                                        37 => 'เกิงจื่อ',
                                        38 => 'ซินโฉ่ว',
                                        39 => 'เหรินอิ๋น',
                                        40 => 'กุ๋ยเหม่า',
                                        41 => 'เจี่ยเฉิน',
                                        42 => 'อี่ซ่ือ',
                                        43 => 'ป่ิงอู้',
                                        44 => 'ติงเว่ย',
                                        45 => 'อู้เซิน',
                                        46 => 'จี๋โหย่ว',
                                        47 => 'เกิงซู',
                                        48 => 'ซินฮ่าย',
                                        49 => 'เหรินจ่ือ',
                                        50 => 'กุุ๋่ยโฉ่ว',
                                        51 => 'เจี่ยอิ๋น',
                                        52 => 'อ๋ีเหม่า',
                                        53 => 'ปิ่งเฉิน',
                                        54 => 'ติงซื่อ',
                                        55 => 'อู้อู้',
                                        56 => 'จ่ีเว่ย',
                                        57 => 'เกิงเซิน',
                                        58 => 'ซินโหย่ว',
                                        59 => 'เหรินซู',
                                        60 => 'กุ่ยฮ่าย'
                                    ),
                                    'narrow' => array(
                                        1 => 'เจี่ยจื่อ',
                                        2 => 'อี๋โฉ่ว',
                                        3 => 'ปิ่งอิ๋น',
                                        4 => 'ติงเหม่า',
                                        5 => 'อู้เฉิน',
                                        6 => 'จี่ซื่อ',
                                        7 => 'เกิงอู้',
                                        8 => 'ซินเว่ย',
                                        9 => 'เหรินเซิน',
                                        10 => 'กุุ๋่ยโหย่ว',
                                        11 => 'เจ่ียซู',
                                        12 => 'อี๋ฮ่าย',
                                        13 => 'ปิ๋ิ่งจื่อ',
                                        14 => 'ติงโฉ่ว',
                                        15 => 'อู้อิ๋น',
                                        16 => 'จี๋เหม่า',
                                        17 => 'เกิงเฉิน',
                                        18 => 'ซินซื่อ',
                                        19 => 'เหรินอู้',
                                        20 => 'กุ่ยเว่ย',
                                        21 => 'เจี่ยเซิน',
                                        22 => 'อี๋โหย่ว',
                                        23 => 'ปิ่งซู',
                                        24 => 'ติงฮ่าย',
                                        25 => 'อู้จื่อ',
                                        26 => 'จี๋โฉ่ว',
                                        27 => 'เกิงอิ๋น',
                                        28 => 'ซินเหม่า',
                                        29 => 'เหรินเฉิน',
                                        30 => 'กุ่ยซ่อ',
                                        31 => 'เจ่ียอู้',
                                        32 => 'อี่เว่ย',
                                        33 => 'ป่ิงเซิน',
                                        34 => 'ติงโหย่ว',
                                        35 => 'อู้ซู',
                                        36 => 'จี่ฮ่าย',
                                        37 => 'เกิงจื่อ',
                                        38 => 'ซินโฉ่ว',
                                        39 => 'เหรินอิ๋น',
                                        40 => 'กุ๋ยเหม่า',
                                        41 => 'เจี่ยเฉิน',
                                        42 => 'อี่ซ่ือ',
                                        43 => 'ป่ิงอู้',
                                        44 => 'ติงเว่ย',
                                        45 => 'อู้เซิน',
                                        46 => 'จี๋โหย่ว',
                                        47 => 'เกิงซู',
                                        48 => 'ซินฮ่าย',
                                        49 => 'เหรินจ่ือ',
                                        50 => 'กุุ๋่ยโฉ่ว',
                                        51 => 'เจี่ยอิ๋น',
                                        52 => 'อ๋ีเหม่า',
                                        53 => 'ปิ่งเฉิน',
                                        54 => 'ติงซื่อ',
                                        55 => 'อู้อู้',
                                        56 => 'จ่ีเว่ย',
                                        57 => 'เกิงเซิน',
                                        58 => 'ซินโหย่ว',
                                        59 => 'เหรินซู',
                                        60 => 'กุ่ยฮ่าย'
                                    ),
                                    'wide' => array(
                                        1 => 'เจี่ยจื่อ',
                                        2 => 'อี๋โฉ่ว',
                                        3 => 'ปิ่งอิ๋น',
                                        4 => 'ติงเหม่า',
                                        5 => 'อู้เฉิน',
                                        6 => 'จี่ซื่อ',
                                        7 => 'เกิงอู้',
                                        8 => 'ซินเว่ย',
                                        9 => 'เหรินเซิน',
                                        10 => 'กุุ๋่ยโหย่ว',
                                        11 => 'เจ่ียซู',
                                        12 => 'อี๋ฮ่าย',
                                        13 => 'ปิ๋ิ่งจื่อ',
                                        14 => 'ติงโฉ่ว',
                                        15 => 'อู้อิ๋น',
                                        16 => 'จี๋เหม่า',
                                        17 => 'เกิงเฉิน',
                                        18 => 'ซินซื่อ',
                                        19 => 'เหรินอู้',
                                        20 => 'กุ่ยเว่ย',
                                        21 => 'เจี่ยเซิน',
                                        22 => 'อี๋โหย่ว',
                                        23 => 'ปิ่งซู',
                                        24 => 'ติงฮ่าย',
                                        25 => 'อู้จื่อ',
                                        26 => 'จี๋โฉ่ว',
                                        27 => 'เกิงอิ๋น',
                                        28 => 'ซินเหม่า',
                                        29 => 'เหรินเฉิน',
                                        30 => 'กุ่ยซ่อ',
                                        31 => 'เจ่ียอู้',
                                        32 => 'อี่เว่ย',
                                        33 => 'ป่ิงเซิน',
                                        34 => 'ติงโหย่ว',
                                        35 => 'อู้ซู',
                                        36 => 'จี่ฮ่าย',
                                        37 => 'เกิงจื่อ',
                                        38 => 'ซินโฉ่ว',
                                        39 => 'เหรินอิ๋น',
                                        40 => 'กุ๋ยเหม่า',
                                        41 => 'เจี่ยเฉิน',
                                        42 => 'อี่ซ่ือ',
                                        43 => 'ป่ิงอู้',
                                        44 => 'ติงเว่ย',
                                        45 => 'อู้เซิน',
                                        46 => 'จี๋โหย่ว',
                                        47 => 'เกิงซู',
                                        48 => 'ซินฮ่าย',
                                        49 => 'เหรินจ่ือ',
                                        50 => 'กุุ๋่ยโฉ่ว',
                                        51 => 'เจี่ยอิ๋น',
                                        52 => 'อ๋ีเหม่า',
                                        53 => 'ปิ่งเฉิน',
                                        54 => 'ติงซื่อ',
                                        55 => 'อู้อู้',
                                        56 => 'จ่ีเว่ย',
                                        57 => 'เกิงเซิน',
                                        58 => 'ซินโหย่ว',
                                        59 => 'เหรินซู',
                                        60 => 'กุ่ยฮ่าย'
                                    )
                                )
                            ),
                            'zodiacs' => array(
                                'format' => array(
                                    'abbreviated' => array(
                                        1 => 'หนู',
                                        2 => 'วัว',
                                        3 => 'เสือ',
                                        4 => 'กระต่าย',
                                        5 => 'มังกร',
                                        6 => 'งู',
                                        7 => 'ม้า',
                                        8 => 'แพะ',
                                        9 => 'ลิง',
                                        10 => 'ไก่ตัวผู้',
                                        11 => 'สุนัข',
                                        12 => 'หมู'
                                    ),
                                    'narrow' => array(
                                        1 => 'หนู',
                                        2 => 'วัว',
                                        3 => 'เสือ',
                                        4 => 'กระต่าย',
                                        5 => 'มังกร',
                                        6 => 'งู',
                                        7 => 'ม้า',
                                        8 => 'แพะ',
                                        9 => 'ลิง',
                                        10 => 'ไก่ตัวผู้',
                                        11 => 'สุนัข',
                                        12 => 'หมู'
                                    ),
                                    'wide' => array(
                                        1 => 'หนู',
                                        2 => 'วัว',
                                        3 => 'เสือ',
                                        4 => 'กระต่าย',
                                        5 => 'มังกร',
                                        6 => 'งู',
                                        7 => 'ม้า',
                                        8 => 'แพะ',
                                        9 => 'ลิง',
                                        10 => 'ไก่ตัวผู้',
                                        11 => 'สุนัข',
                                        12 => 'หมู'
                                    )
                                )
                            )
                        ),
                        'dateFormats' => array(
                            'full' => 'EEEE, U MMMM d',
                            'long' => 'U MMMM d',
                            'medium' => 'U MMM d',
                            'short' => 'y-M-d'
                        ),
                        'timeFormats' => array(
                            'full' => 'H นาฬิกา mm นาที ss วินาที zzzz',
                            'long' => 'H นาฬิกา mm นาที ss วินาที z',
                            'medium' => 'HH:mm:ss',
                            'short' => 'HH:mm'
                        ),
                        'dateTimeFormats' => array(
                            'full' => '{1} {0}',
                            'long' => '{1} {0}',
                            'medium' => '{1} {0}',
                            'short' => '{1} {0}',
                            'availableFormats' => array(
                                'd' => 'd',
                                'Ed' => 'd, E',
                                'Gy' => 'U',
                                'GyMMM' => 'U MMM',
                                'GyMMMd' => 'U MMM d',
                                'GyMMMEd' => 'U MMM d, E',
                                'h' => 'h a',
                                'H' => 'HH',
                                'hm' => 'h:mm a',
                                'Hm' => 'HH:mm',
                                'hms' => 'h:mm:ss a',
                                'Hms' => 'HH:mm:ss',
                                'M' => 'L',
                                'Md' => 'MM-dd',
                                'MEd' => 'MM-dd, E',
                                'MMM' => 'LLL',
                                'MMMd' => 'MMM d',
                                'MMMEd' => 'MMM d, E',
                                'ms' => 'mm:ss',
                                'y' => 'U',
                                'yMd' => 'y-MM-dd',
                                'yyyy' => 'U',
                                'yyyyM' => 'y-MM',
                                'yyyyMd' => 'y-MM-dd',
                                'yyyyMEd' => 'y-MM-dd, E',
                                'yyyyMMM' => 'U MMM',
                                'yyyyMMMd' => 'U MMM d',
                                'yyyyMMMEd' => 'U MMM d, E',
                                'yyyyQQQ' => 'U QQQ',
                                'yyyyQQQQ' => 'U QQQQ'
                            ),
                            'appendItems' => array(
                                'Day' => '{0} ({2}: {1})',
                                'Day-Of-Week' => '{0} {1}',
                                'Era' => '{1} {0}',
                                'Hour' => '{0} ({2}: {1})',
                                'Minute' => '{0} ({2}: {1})',
                                'Month' => '{0} ({2}: {1})',
                                'Quarter' => '{0} ({2}: {1})',
                                'Second' => '{0} ({2}: {1})',
                                'Timezone' => '{0} {1}',
                                'Week' => '{0} ({2}: {1})',
                                'Year' => '{1} {0}'
                            ),
                            'intervalFormats' => array(
                                'intervalFormatFallback' => '{0} – {1}',
                                'd' => array(
                                    'd' => 'd–d'
                                ),
                                'h' => array(
                                    'a' => 'h a – h a',
                                    'h' => 'h–h a'
                                ),
                                'H' => array(
                                    'H' => 'HH–HH'
                                ),
                                'hm' => array(
                                    'a' => 'h:mm a – h:mm a',
                                    'h' => 'h:mm–h:mm a',
                                    'm' => 'h:mm–h:mm a'
                                ),
                                'Hm' => array(
                                    'H' => 'HH:mm–HH:mm',
                                    'm' => 'HH:mm–HH:mm'
                                ),
                                'hmv' => array(
                                    'a' => 'h:mm a – h:mm a v',
                                    'h' => 'h:mm–h:mm a v',
                                    'm' => 'h:mm–h:mm a v'
                                ),
                                'Hmv' => array(
                                    'H' => 'HH:mm–HH:mm v',
                                    'm' => 'HH:mm–HH:mm v'
                                ),
                                'hv' => array(
                                    'a' => 'h a – h a v',
                                    'h' => 'h–h a v'
                                ),
                                'Hv' => array(
                                    'H' => 'HH–HH v'
                                ),
                                'M' => array(
                                    'M' => 'MM–MM'
                                ),
                                'Md' => array(
                                    'd' => 'MM-dd – MM-dd',
                                    'M' => 'MM-dd – MM-dd'
                                ),
                                'MEd' => array(
                                    'd' => 'MM-dd, E – MM-dd, E',
                                    'M' => 'MM-dd, E – MM-dd, E'
                                ),
                                'MMM' => array(
                                    'M' => 'LLL–LLL'
                                ),
                                'MMMd' => array(
                                    'd' => 'MMM d–d',
                                    'M' => 'MMM d – MMM d'
                                ),
                                'MMMEd' => array(
                                    'd' => 'MMM d, E – MMM d, E',
                                    'M' => 'MMM d, E – MMM d, E'
                                ),
                                'y' => array(
                                    'y' => 'U–U'
                                ),
                                'yM' => array(
                                    'M' => 'y-MM – y-MM',
                                    'y' => 'y-MM – y-MM'
                                ),
                                'yMd' => array(
                                    'd' => 'y-MM-dd – y-MM-dd',
                                    'M' => 'y-MM-dd – y-MM-dd',
                                    'y' => 'y-MM-dd – y-MM-dd'
                                ),
                                'yMEd' => array(
                                    'd' => 'y-MM-dd, E – y-MM-dd, E',
                                    'M' => 'y-MM-dd, E – y-MM-dd, E',
                                    'y' => 'y-MM-dd, E – y-MM-dd, E'
                                ),
                                'yMMM' => array(
                                    'M' => 'U MMM–MMM',
                                    'y' => 'U MMM – U MMM'
                                ),
                                'yMMMd' => array(
                                    'd' => 'U MMM d–d',
                                    'M' => 'U MMM d – MMM d',
                                    'y' => 'U MMM d – U MMM d'
                                ),
                                'yMMMEd' => array(
                                    'd' => 'U MMM d, E – MMM d, E',
                                    'M' => 'U MMM d, E – MMM d, E',
                                    'y' => 'U MMM d, E – U MMM d, E'
                                ),
                                'yMMMM' => array(
                                    'M' => 'U MMMM–MMMM',
                                    'y' => 'U MMMM – U MMMM'
                                )
                            )
                        )
                    )
                )
            )
        )
    )
);

return $data;
