<?php
$data = array(
    'main' => array(
        'th' => array(
            'localeDisplayNames' => array(
                'localeDisplayPattern' => array(
                    'localePattern' => '{0} ({1})',
                    'localeSeparator' => ', ',
                    'localeKeyTypePattern' => '{0}: {1}'
                ),
                'keys' => array(
                    'calendar' => 'ปฏิทิน',
                    'colAlternate' => 'ละเว้นการจัดเรียงสัญลักษณ์',
                    'colBackwards' => 'การจัดเรียงเสียงหนักเบาในลำดับถอยหลัง',
                    'colCaseFirst' => 'การเรียงลำดับตัวพิมพ์ใหญ่/ตัวพิมพ์เล็ก',
                    'colCaseLevel' => 'การจัดเรียงตามความสำคัญของตัวพิมพ์อักษร',
                    'colHiraganaQuaternary' => 'การจัดเรียงตัวอักษรคะนะ',
                    'collation' => 'ลำดับการจัดเรียง',
                    'colNormalization' => 'การจัดเรียงแบบที่เป็นปกติ',
                    'colNumeric' => 'การจัดเรียงตัวเลข',
                    'colStrength' => 'ความแม่นยำในการจัดเรียง',
                    'currency' => 'เงินตรา',
                    'numbers' => 'ตัวเลข',
                    'timezone' => 'เขตเวลา',
                    'va' => 'ตัวแปรภาษาถิ่น',
                    'variableTop' => 'จัดเรียงเป็นสัญลักษณ์',
                    'x' => 'ใช้งานส่วนบุคคล'
                ),
                'types' => array(
                    'calendar' => array(
                        'buddhist' => 'ปฏิทินพุทธ',
                        'chinese' => 'ปฏิทินจีน',
                        'coptic' => 'ปฏิทินคอปติก',
                        'dangi' => 'dangi',
                        'ethiopic' => 'ปฏิทินเอธิโอเปีย',
                        'ethiopic-amete-alem' => 'ปฏิทินปีโลกเอธิโอเปีย',
                        'gregorian' => 'ปฏิทินเกรกอเรียน',
                        'hebrew' => 'ปฏิทินฮิบรู',
                        'indian' => 'ปฏิทินแห่งชาติอินเดีย',
                        'islamic' => 'ปฏิทินอิสลาม',
                        'islamic-civil' => 'ปฏิทินอิสลามซีวิล',
                        'iso8601' => 'iso8601',
                        'japanese' => 'ปฏิทินญี่ปุ่น',
                        'persian' => 'ปฏิทินเปอร์เชีย',
                        'roc' => 'ปฏิทินไต้หวัน'
                    ),
                    'collation' => array(
                        'standard' => 'standard',
                        'traditional' => 'เรียงตามแบบดั้งเดิม',
                        'big5han' => 'เรียงตามอักษรจีนดั้งเดิม',
                        'dictionary' => 'เรียงตามพจนานุกรม',
                        'ducet' => 'ลำดับการจัดเรียงรหัสยูนิโค้ดค่าเริ่มต้น',
                        'gb2312han' => 'เรียงตามอักษรจีนประยุกต์',
                        'phonebook' => 'เรียงตามสมุดโทรศัพท์',
                        'phonetic' => 'ลำดักการจัดเรียงตามคำอ่าน',
                        'pinyin' => 'เรียงตามการถอดเสียงภาษาจีน',
                        'reformed' => 'เรียงตามลำดับล่าสุด',
                        'search' => 'การค้นหาทั่วไป',
                        'searchjl' => 'ค้นหาตามพยัญชนะขึ้นต้นที่เป็นฮันกึล',
                        'stroke' => 'เรียงตามการลากเส้น',
                        'unihan' => 'เรียงลำดับตามจำนวนขีด',
                        'zhuyin' => 'zhuyin'
                    ),
                    'numbers' => array(
                        'native' => 'ตัวเลขพื้นเมือง',
                        'traditional' => 'ตัวเลขแบบดั้งเดิม',
                        'finance' => 'ตัวเลขทางการเงิน',
                        'arab' => 'ตัวเลขอินเดีย-อารบิก',
                        'arabext' => 'ตัวเลขอินเดีย-อารบิกตัวเต็ม',
                        'armn' => 'ตัวเลขอาร์เมเนีย',
                        'armnlow' => 'ตัวเลขอาร์เมเนียพิมพ์เล็ก',
                        'bali' => 'ตัวเลขบาหลี',
                        'beng' => 'ตัวเลขบังกลาเทศ',
                        'brah' => 'brah',
                        'cakm' => 'cakm',
                        'cham' => 'ตัวเลขชาม',
                        'deva' => 'ตัวเลขเทวนาครี',
                        'ethi' => 'ตัวเลขเอธิโอเปีย',
                        'fullwide' => 'ตัวเลขแบบเต็มขนาด',
                        'geor' => 'ตัวเลขจอร์เจีย',
                        'grek' => 'ตัวเลขกรีก',
                        'greklow' => 'ตัวเลขกรีกพิมพ์เล็ก',
                        'gujr' => 'ตัวเลขคุชราต',
                        'guru' => 'ตัวเลขกูร์มูคี',
                        'hanidec' => 'ตัวเลขทศนิยมจีน',
                        'hans' => 'ตัวเลขจีนตัวย่อ',
                        'hansfin' => 'ตัวเลขทางการเงินแบบตัวย่อของจีน',
                        'hant' => 'ตัวเลขจีนตัวเต็ม',
                        'hantfin' => 'ตัวเลขทางการเงินแบบตัวเต็มของจีน',
                        'hebr' => 'ตัวเลขฮิบรู',
                        'java' => 'ตัวเลขชวา',
                        'jpan' => 'ตัวเลขญี่ปุ่น',
                        'jpanfin' => 'ตัวเลขทางการเงินของญี่ปุ่น',
                        'kali' => 'ตัวเลขคยาห์',
                        'khmr' => 'ตัวเลขเขมร',
                        'knda' => 'ตัวเลขกันนาดา',
                        'lana' => 'ตัวเลขไททัมโฮรา',
                        'lanatham' => 'ตัวเลขไททัมทัม',
                        'laoo' => 'ตัวเลขลาว',
                        'latn' => 'ตัวเลขอารบิค',
                        'lepc' => 'ตัวเลขเลปชา',
                        'limb' => 'ตัวเลขลิมบู',
                        'mlym' => 'ตัวเลขมาลายาลัม',
                        'mong' => 'ตัวเลขมองโกเลีย',
                        'mtei' => 'ตัวเลขเมไตมาเยก',
                        'mymr' => 'ตัวเลขพม่า',
                        'mymrshan' => 'ตัวเลขชานพม่า',
                        'nkoo' => 'ตัวเลขเอ็นโก',
                        'olck' => 'ตัวเลขโอลจิกิ',
                        'orya' => 'ตัวเลขโอริยา',
                        'osma' => 'osma',
                        'roman' => 'ตัวเลขโรมัน',
                        'romanlow' => 'ตัวเลขโรมันพิมพ์เล็ก',
                        'saur' => 'ตัวเลขเศารัชธรา',
                        'shrd' => 'shrd',
                        'sora' => 'sora',
                        'sund' => 'ตัวเลขซุนดา',
                        'takr' => 'takr',
                        'talu' => 'ตัวเลขไทลื้อใหม่',
                        'taml' => 'ตัวเลขทมิฬดั้งเดิม',
                        'tamldec' => 'ตัวเลขทมิฬ',
                        'telu' => 'ตัวเลขเตลูกู',
                        'thai' => 'ตัวเลขไทย',
                        'tibt' => 'ตัวเลขทิเบต',
                        'vaii' => 'ตัวเลขในระบบวาย (VAI)'
                    ),
                    'colAlternate' => array(
                        'non-ignorable' => 'จัดเรียงสัญลักษณ์',
                        'shifted' => 'จัดเรียงสัญลักษณ์ที่ละไว้'
                    ),
                    'colBackwards' => array(
                        'no' => 'จัดเรียงเสียงหนักเบาตามปกติ',
                        'yes' => 'จัดเรียงเสียงหนักเบาในลำดับถอยหลัง'
                    ),
                    'colCaseFirst' => array(
                        'lower' => 'จัดเรียงลำดับตัวพิมพ์เล็กก่อน',
                        'no' => 'จัดเรียงลำดับตามตัวพิมพ์ปกติ',
                        'upper' => 'จัดเรียงตัวพิมพ์ใหญ่ก่อน'
                    ),
                    'colCaseLevel' => array(
                        'no' => 'จัดเรียงตามความสำคัญของตัวพิมพ์',
                        'yes' => 'จัดเรียงความสำคัญของตัวพิมพ์'
                    ),
                    'colHiraganaQuaternary' => array(
                        'no' => 'จัดเรียงตัวอักษรคะนะแยกต่างหาก',
                        'yes' => 'จัดเรียงตัวอักษรคะนะในแบบอื่น'
                    ),
                    'colNormalization' => array(
                        'no' => 'จัดเรียงโดยไม่ต้องทำให้เป็นแบบปกติ',
                        'yes' => 'จัดเรียงยูนิโค้ดแบบที่เป็นปกติ'
                    ),
                    'colNumeric' => array(
                        'no' => 'จัดเรียงตัวเลขแยก',
                        'yes' => 'จัดเรัยงตัวเลขตามลำดับตัวเลข'
                    ),
                    'colStrength' => array(
                        'identical' => 'จัดเรียงทั้งหมด',
                        'primary' => 'จัดเรียงตัวอักษรฐานเท่านั้น',
                        'quaternary' => 'จัดเรียงตามเสียงหนักเบา/ตัวพิมพ์/ความกว้าง/ตัวอักษรคะนะ',
                        'secondary' => 'จัดเรียงเสียงหนักเบา',
                        'tertiary' => 'จัดเรียงเสียงหนักเบา/ตัวพิมพ์/ความกว้าง'
                    )
                ),
                'codePatterns' => array(
                    'language' => '{0}',
                    'script' => '{0}',
                    'territory' => '{0}'
                )
            )
        )
    )
);

return $data;
