<?php 

return [
  'characters' => [
    'exemplarCharacters' => '[़ ० १ २ ३ ४ ५ ६ ७ ८ ९ ॐ ं ँ ः अ आ इ ई उ ऊ ऋ ऌ ऍ ए ऐ ऑ ओ औ क {क़} ख {ख़} ग {ग़} घ ङ च छ ज {ज़} झ ञ ट ठ ड {ड़} ढ {ढ़} ण त थ द ध न प फ {फ़} ब भ म य {य़} र ल व श ष स ह ळ ऽ ा ि ी ु ू ृ ॄ ॅ े ै ॉ ो ौ ्]',
    'auxiliary' => '[‌‍]',
    'punctuation' => '[\\- , ; \\: ! ? . ( ] \\[ \\] \\{ \\}]',
    'index' => '[ॐ अ आ इ ई उ ऊ ऋ ऌ ऍ ए ऐ ऑ ओ औ क ख ग घ ङ च छ ज झ ञ ट ठ ड ढ ण त थ द ध न प फ ब भ म य र ल व श ष स ह ळ ऽ]',
    'ellipsis' => [
      'initial' => '…{0}',
      'medial' => '{0}…{1}',
      'final' => '{0}…',
      'word-initial' => '… {0}',
      'word-medial' => '{0} … {1}',
      'word-final' => '{0} …',
    ],
    'moreInformation' => '?',
  ],
];
