<?php
$data = array(
    'main' => array(
        'ru' => array(
            'localeDisplayNames' => array(
                'localeDisplayPattern' => array(
                    'localePattern' => '{0} ({1})',
                    'localeSeparator' => ', ',
                    'localeKeyTypePattern' => '{0}: {1}'
                ),
                'keys' => array(
                    'calendar' => 'Календарь',
                    'colAlternate' => 'Игнорировать символы при сортировке',
                    'colBackwards' => 'Обратная сортировка по акценту',
                    'colCaseFirst' => 'Сортировка по верхнему или нижнему регистру',
                    'colCaseLevel' => 'Сортировка с учетом регистра',
                    'colHiraganaQuaternary' => 'Сортировка каны',
                    'collation' => 'Сопоставление',
                    'colNormalization' => 'Нормализованная сортировка',
                    'colNumeric' => 'Сортировка чисел',
                    'colStrength' => 'Эффективность сортировки',
                    'currency' => 'Валюта',
                    'numbers' => 'Цифры',
                    'timezone' => 'Часовой пояс',
                    'va' => 'Вариант региональных настроек',
                    'variableTop' => 'Сортировать как символьный массив',
                    'x' => 'Частное'
                ),
                'types' => array(
                    'calendar' => array(
                        'buddhist' => 'Буддийский календарь',
                        'chinese' => 'Китайский календарь',
                        'coptic' => 'Коптский календарь',
                        'dangi' => 'dangi',
                        'ethiopic' => 'Эфиопский календарь',
                        'ethiopic-amete-alem' => 'Эфиопский календарь "Амете Алем"',
                        'gregorian' => 'Григорианский календарь',
                        'hebrew' => 'Еврейский календарь',
                        'indian' => 'Национальный календарь Индии',
                        'islamic' => 'Исламский календарь',
                        'islamic-civil' => 'Исламский гражданский календарь',
                        'iso8601' => 'iso8601',
                        'japanese' => 'Японский календарь',
                        'persian' => 'Персидский календарь',
                        'roc' => 'Китайский календарь'
                    ),
                    'collation' => array(
                        'standard' => 'standard',
                        'traditional' => 'традиционный порядок',
                        'big5han' => 'Сортировка традиционного китайского языка – Big5',
                        'dictionary' => 'словарный порядок сортировки',
                        'ducet' => 'cтандартная сортировка Unicode',
                        'gb2312han' => 'упрощенный китайский - GB2312',
                        'phonebook' => 'порядок телефонной книги',
                        'phonetic' => 'Фонетический порядок сортировки',
                        'pinyin' => 'пиньинь',
                        'reformed' => 'реформированный порядок сортировки',
                        'search' => 'поиск',
                        'searchjl' => 'Поиск по первой согласной хангыль',
                        'stroke' => 'по чертам',
                        'unihan' => 'сортировка по ключам, затем по чертам',
                        'zhuyin' => 'zhuyin'
                    ),
                    'numbers' => array(
                        'native' => 'Обозначения цифр коренного населения',
                        'traditional' => 'Традиционная система нумерации',
                        'finance' => 'Символы обозначения финансовых показателей',
                        'arab' => 'Арабско-индийские цифры',
                        'arabext' => 'Расширенная система арабско-индийских цифр',
                        'armn' => 'Армянские цифры',
                        'armnlow' => 'Армянские цифры в нижнем регистре',
                        'bali' => 'bali',
                        'beng' => 'Бенгальские цифры',
                        'brah' => 'brah',
                        'cakm' => 'cakm',
                        'cham' => 'cham',
                        'deva' => 'Цифры деванагари',
                        'ethi' => 'Эфиопские цифры',
                        'fullwide' => 'Полный формат цифр',
                        'geor' => 'Грузинские цифры',
                        'grek' => 'Греческие цифры',
                        'greklow' => 'Греческие цифры в нижнем регистре',
                        'gujr' => 'Цифры гуджарати',
                        'guru' => 'Цифры гурмукхи',
                        'hanidec' => 'Китайские десятичные цифры',
                        'hans' => 'Упрощенные китайские цифры',
                        'hansfin' => 'Упрощенные китайские цифры (финансы)',
                        'hant' => 'Традиционные китайские цифры',
                        'hantfin' => 'Традиционные китайские цифры (финансы)',
                        'hebr' => 'Цифры на иврите',
                        'java' => 'java',
                        'jpan' => 'Японские цифры',
                        'jpanfin' => 'Японские цифры (финансы)',
                        'kali' => 'kali',
                        'khmr' => 'Кхмерские цифры',
                        'knda' => 'Цифры каннада',
                        'lana' => 'lana',
                        'lanatham' => 'lanatham',
                        'laoo' => 'Лаосские цифры',
                        'latn' => 'Современные цифры',
                        'lepc' => 'lepc',
                        'limb' => 'limb',
                        'mlym' => 'Цифры малаялам',
                        'mong' => 'Монгольские цифры',
                        'mtei' => 'mtei',
                        'mymr' => 'Бирманские цифры',
                        'mymrshan' => 'mymrshan',
                        'nkoo' => 'nkoo',
                        'olck' => 'olck',
                        'orya' => 'Цифры ория',
                        'osma' => 'osma',
                        'roman' => 'Римские цифры',
                        'romanlow' => 'Римские цифры в нижнем регистре',
                        'saur' => 'saur',
                        'shrd' => 'shrd',
                        'sora' => 'sora',
                        'sund' => 'sund',
                        'takr' => 'takr',
                        'talu' => 'talu',
                        'taml' => 'Тамильские цифры',
                        'tamldec' => 'Тамильские цифры',
                        'telu' => 'Цифры телугу',
                        'thai' => 'Тайские цифры',
                        'tibt' => 'Тибетские цифры',
                        'vaii' => 'Цифры языка вай'
                    ),
                    'colAlternate' => array(
                        'non-ignorable' => 'Сортировка символов',
                        'shifted' => 'Сортировка без учета символов'
                    ),
                    'colBackwards' => array(
                        'no' => 'Сортировка по акцентам в обычном порядке',
                        'yes' => 'Сортировка по акцентам в обратном порядке'
                    ),
                    'colCaseFirst' => array(
                        'lower' => 'Приоритетная сортировка слов в нижнем регистре',
                        'no' => 'Сортировка по стандартным правилам',
                        'upper' => 'Приоритетная сортировка слов в верхнем регистре'
                    ),
                    'colCaseLevel' => array(
                        'no' => 'Сортировка вне зависимости от регистра',
                        'yes' => 'Сортировка с учетом регистра'
                    ),
                    'colHiraganaQuaternary' => array(
                        'no' => 'Отдельная сортировка каны',
                        'yes' => 'Сортировка каны другим способом'
                    ),
                    'colNormalization' => array(
                        'no' => 'Сортировка без нормализации',
                        'yes' => 'Сортировка нормализованных символов Unicode'
                    ),
                    'colNumeric' => array(
                        'no' => 'Отдельная сортировка числовых значений',
                        'yes' => 'Сортировка численных значений'
                    ),
                    'colStrength' => array(
                        'identical' => 'Полная сортировка',
                        'primary' => 'Сортировка только по символам, обозначающим разрядность',
                        'quaternary' => 'Сортировка по акцентам/регистрам/длине строки/кане',
                        'secondary' => 'Сортировка по акцентам',
                        'tertiary' => 'Сортировка по акцентам/регистру/длине строки'
                    )
                ),
                'codePatterns' => array(
                    'language' => 'Язык: {0}',
                    'script' => 'Написание: {0}',
                    'territory' => 'Регион: {0}'
                )
            )
        )
    )
);

return $data;
