<?php 

return [
  'characters' => [
    'exemplarCharacters' => '[಼ ೦ ೧ ೨ ೩ ೪ ೫ ೬ ೭ ೮ ೯ ಅ ಆ ಇ ಈ ಉ ಊ ಋ ೠ ಌ ೡ ಎ ಏ ಐ ಒ ಓ ಔ ಂ ಃ ಕ ಖ ಗ ಘ ಙ ಚ ಛ ಜ ಝ ಞ ಟ ಠ ಡ ಢ ಣ ತ ಥ ದ ಧ ನ ಪ ಫ ಬ ಭ ಮ ಯ ರ ಱ ಲ ವ ಶ ಷ ಸ ಹ ಳ ೞ ಽ ಾ ಿ ೀ ು ೂ ೃ ೄ ೆ ೇ ೈ ೊ ೋ ೌ ್ ೕ ೖ]',
    'auxiliary' => '[‌‍]',
    'punctuation' => '[\\- ‐ – — , ; \\: ! ? . … \' ‘ ’ " “ ” ( ] \\[ \\] @ * / \\& # ′ ″]',
    'index' => '[ಅ ಆ ಇ ಈ ಉ ಊ ಋ ೠ ಌ ೡ ಎ ಏ ಐ ಒ ಓ ಔ ಕ ಖ ಗ ಘ ಙ ಚ ಛ ಜ ಝ ಞ ಟ ಠ ಡ ಢ ಣ ತ ಥ ದ ಧ ನ ಪ ಫ ಬ ಭ ಮ ಯ ರ ಱ ಲ ವ ಶ ಷ ಸ ಹ ಳ ೞ]',
    'ellipsis' => [
      'initial' => '…{0}',
      'medial' => '{0}…{1}',
      'final' => '{0}…',
      'word-initial' => '… {0}',
      'word-medial' => '{0} … {1}',
      'word-final' => '{0} …',
    ],
    'moreInformation' => '?',
  ],
];
