<?php
$data = array(
    'main' => array(
        'uk' => array(
            'localeDisplayNames' => array(
                'localeDisplayPattern' => array(
                    'localePattern' => '{0} ({1})',
                    'localeSeparator' => ',',
                    'localeKeyTypePattern' => '{0}: {1}'
                ),
                'keys' => array(
                    'calendar' => 'Календар',
                    'colAlternate' => 'Ігнорувати сортування за символами',
                    'colBackwards' => 'Зворотне сортування за діактричними знаками',
                    'colCaseFirst' => 'Упорядкування за великими/малими символами',
                    'colCaseLevel' => 'Сортування з урахуванням регістру',
                    'colHiraganaQuaternary' => 'Сортування кана',
                    'collation' => 'Порядок сортування',
                    'colNormalization' => 'Уніфіковане сортування',
                    'colNumeric' => 'Цифрове сортування',
                    'colStrength' => 'Інтенсивність сортування',
                    'currency' => 'Валюта',
                    'numbers' => 'Цифри',
                    'timezone' => 'Часовий пояс',
                    'va' => 'Варіант мовного коду',
                    'variableTop' => 'Сортувати як символи',
                    'x' => 'Особисте використання'
                ),
                'types' => array(
                    'calendar' => array(
                        'buddhist' => 'Буддійський календар',
                        'chinese' => 'Китайський календар',
                        'coptic' => 'Коптський календар',
                        'dangi' => 'dangi',
                        'ethiopic' => 'Ефіопський календар',
                        'ethiopic-amete-alem' => 'Ефіопський Амете Алем календар',
                        'gregorian' => 'Григоріанський календар',
                        'hebrew' => 'Єврейський календар',
                        'indian' => 'Індійський світський календар',
                        'islamic' => 'Мусульманський календар',
                        'islamic-civil' => 'Мусульманський світський календар',
                        'iso8601' => 'iso8601',
                        'japanese' => 'Японський календар',
                        'persian' => 'Перський календар',
                        'roc' => 'Китайський григоріанський'
                    ),
                    'collation' => array(
                        'standard' => 'standard',
                        'traditional' => 'Традиційний',
                        'big5han' => 'Китайський традиційний',
                        'dictionary' => 'Порядок сортування: за словником',
                        'ducet' => 'Порядок сортування: Unicode за умовчанням',
                        'gb2312han' => 'Китайський спрощений',
                        'phonebook' => 'Телефонна книга',
                        'phonetic' => 'Фонетичний порядок сортування',
                        'pinyin' => 'Порядок піньїн',
                        'reformed' => 'Порядок сортування: за виправленнями',
                        'search' => 'Універсальний пошук',
                        'searchjl' => 'Пошук за початковою приголосною хангул',
                        'stroke' => 'Порядок натискання клавіш',
                        'unihan' => 'Порядок сортування: за штрихами в корені',
                        'zhuyin' => 'zhuyin'
                    ),
                    'numbers' => array(
                        'native' => 'Місцеві цифри',
                        'traditional' => 'Традиційні символи чисел',
                        'finance' => 'Фінансові символи чисел',
                        'arab' => 'Арабсько-індійські цифри',
                        'arabext' => 'Арабсько-індійські розширені цифри',
                        'armn' => 'Вірменські символи чисел',
                        'armnlow' => 'Вірменські малі символи чисел',
                        'bali' => 'bali',
                        'beng' => 'Цифри бенгалі',
                        'brah' => 'brah',
                        'cakm' => 'cakm',
                        'cham' => 'cham',
                        'deva' => 'Цифри девангарі',
                        'ethi' => 'Ефіопські символи чисел',
                        'fullwide' => 'Числові знаки повної ширини',
                        'geor' => 'Грузинські символи чисел',
                        'grek' => 'Грецькі символи чисел',
                        'greklow' => 'Грецькі малі символи чисел',
                        'gujr' => 'Цифри гуджараті',
                        'guru' => 'Цифри гурмукхі',
                        'hanidec' => 'Китайські символи десяткових чисел',
                        'hans' => 'Китайські символи чисел (спрощене письмо)',
                        'hansfin' => 'Китайські фінансові символи чисел (спрощене письмо)',
                        'hant' => 'Китайські символи чисел (традиційне письмо)',
                        'hantfin' => 'Китайські фінансові символи чисел (традиційне письмо)',
                        'hebr' => 'Символи чисел івриту',
                        'java' => 'java',
                        'jpan' => 'Японські символи чисел',
                        'jpanfin' => 'Японські фінансові символи чисел',
                        'kali' => 'kali',
                        'khmr' => 'Кхмерські цифри',
                        'knda' => 'Цифри каннада',
                        'lana' => 'lana',
                        'lanatham' => 'lanatham',
                        'laoo' => 'Лаоські цифри',
                        'latn' => 'Західні цифри',
                        'lepc' => 'lepc',
                        'limb' => 'limb',
                        'mlym' => 'Цифри малаялам',
                        'mong' => 'Монгольські цифри',
                        'mtei' => 'mtei',
                        'mymr' => 'Цифри М’янми',
                        'mymrshan' => 'mymrshan',
                        'nkoo' => 'nkoo',
                        'olck' => 'olck',
                        'orya' => 'Цифри орія',
                        'osma' => 'osma',
                        'roman' => 'Римські цифри',
                        'romanlow' => 'Римські малі цифри',
                        'saur' => 'saur',
                        'shrd' => 'shrd',
                        'sora' => 'sora',
                        'sund' => 'sund',
                        'takr' => 'takr',
                        'talu' => 'talu',
                        'taml' => 'Тамільські традиційні символи чисел',
                        'tamldec' => 'Тамільські цифри',
                        'telu' => 'Цифри телугу',
                        'thai' => 'Тайські цифри',
                        'tibt' => 'Тибетські цифри',
                        'vaii' => 'Цифри ваї'
                    ),
                    'colAlternate' => array(
                        'non-ignorable' => 'Сортувати за символами',
                        'shifted' => 'Сортувати, ігноруючи символи'
                    ),
                    'colBackwards' => array(
                        'no' => 'Сортувати за діактричними знаками уніфіковано',
                        'yes' => 'Сортувати за діактричними знаками у зворотньому порядку'
                    ),
                    'colCaseFirst' => array(
                        'lower' => 'Сортувати спершу за малими символами',
                        'no' => 'Сортувати в порядку звичайного регістру',
                        'upper' => 'Сортувати спершу за великими символами'
                    ),
                    'colCaseLevel' => array(
                        'no' => 'Сортувати без урахування регістру',
                        'yes' => 'Сортувати з урахуванням регістру'
                    ),
                    'colHiraganaQuaternary' => array(
                        'no' => 'Сортувати за кана окремо',
                        'yes' => 'Сортувати за кана інакше'
                    ),
                    'colNormalization' => array(
                        'no' => 'Сортувати без уніфікації',
                        'yes' => 'Сортувати за Unicode уніфіковано'
                    ),
                    'colNumeric' => array(
                        'no' => 'Сортувати за цифрами окремо',
                        'yes' => 'Сортувати за цифрами чисельно'
                    ),
                    'colStrength' => array(
                        'identical' => 'Сортувати всі',
                        'primary' => 'Сортувати лише за основними літерами',
                        'quaternary' => 'Сортувати за діактричними знаками/регістром/шириною/кана',
                        'secondary' => 'Сортувати за діактричними знаками',
                        'tertiary' => 'Сортувати за діактричними знаками/регістром/шириною'
                    )
                ),
                'codePatterns' => array(
                    'language' => 'Мова з кодом {0}',
                    'script' => 'Скрипт із кодом {0}',
                    'territory' => 'Територія з кодом {0}'
                )
            )
        )
    )
);

return $data;
