<?php 

return [
  'characters' => [
    'exemplarCharacters' => '[ੱ ੰ ਼ ੦ ੧ ੨ ੩ ੪ ੫ ੬ ੭ ੮ ੯ ੴ ੳ ਉ ਊ ਓ ਅ ਆ ਐ ਔ ੲ ਇ ਈ ਏ ਸ {ਸ਼} ਹ ਕ ਖ {ਖ਼} ਗ {ਗ਼} ਘ ਙ ਚ ਛ ਜ {ਜ਼} ਝ ਞ ਟ ਠ ਡ ਢ ਣ ਤ ਥ ਦ ਧ ਨ ਪ ਫ {ਫ਼} ਬ ਭ ਮ ਯ ਰ ਲ ਵ ੜ ੍ ਾ ਿ ੀ ੁ ੂ ੇ ੈ ੋ ੌ]',
    'auxiliary' => '[‌‍ ਃ ਂ ਁ {ਲ਼}]',
    'punctuation' => '[\\- ‐ – — , ; \\: ! ? . \' ‘ ’ " “ ” ( ] \\[ \\] / \\& ′ ″]',
    'index' => '[ੴ ੳ ਉ ਊ ਓ ਅ ਆ ਐ ਔ ੲ ਇ ਈ ਏ ਸ ਹ ਕ ਖ ਗ ਘ ਙ ਚ ਛ ਜ ਝ ਞ ਟ ਠ ਡ ਢ ਣ ਤ ਥ ਦ ਧ ਨ ਪ ਫ ਬ ਭ ਮ ਯ ਰ ਲ ਵ ੜ]',
    'ellipsis' => [
      'initial' => '…{0}',
      'medial' => '{0}…{1}',
      'final' => '{0}…',
      'word-initial' => '… {0}',
      'word-medial' => '{0} … {1}',
      'word-final' => '{0} …',
    ],
    'moreInformation' => '?',
  ],
];
