<?php 

return [
  'characters' => [
    'exemplarCharacters' => '[઼ ૐ ં ઁ ઃ અ આ ઇ ઈ ઉ ઊ ઋ ૠ ઍ એ ઐ ઑ ઓ ઔ ક ખ ગ ઘ ઙ ચ છ જ ઝ ઞ ટ ઠ ડ ઢ ણ ત થ દ ધ ન પ ફ બ ભ મ ય ર લ વ શ ષ સ હ ળ ઽ ા િ ી ુ ૂ ૃ ૄ ૅ ે ૈ ૉ ો ૌ ્]',
    'auxiliary' => '[‌‍ ૰]',
    'punctuation' => '[\\- ‐ – — , ; \\: ! ? . … \' ‘ ’ " “ ” ( ] \\[ \\] § @ * / \\& # † ‡ ′ ″]',
    'index' => '[અ {અં} {અઃ} આ ઇ ઈ ઉ ઊ ઋ ઍ એ ઐ ઑ ઓ ઔ ક {ક્ષ} ખ ગ ઘ ઙ ચ છ જ {જ્ઞ} ઝ ઞ ટ ઠ ડ ઢ ણ ત {ત્ર} થ દ ધ ન પ ફ બ ભ મ ય ર લ વ શ ષ સ હ ળ]',
    'ellipsis' => [
      'initial' => '…{0}',
      'medial' => '{0}…{1}',
      'final' => '{0}…',
      'word-initial' => '… {0}',
      'word-medial' => '{0} … {1}',
      'word-final' => '{0} …',
    ],
    'moreInformation' => '?',
  ],
];
